{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration",
    "id":  "379c94bb-054a-40d1-8889-c8e47f38d839",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-07-09T21:52:13.3576384Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-07-09T21:52:13.3576384Z",
    "description":  "CIS Microsoft Intune for Windows 11 Benchmark v 3.0.1 policies for Intune\nCIS Level 1\nCustom Policies",
    "displayName":  "CIS Microsoft Intune for Windows 11 Benchmark v 3.0.1 - Custom_canary_v1",
    "version":  1,
    "omaSettings@odata.type":  "#Collection(microsoft.graph.omaSetting)",
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "auto_connect_hotspots",
                            "description":  "Allow Windows to automatically connect to suggested open hotspots, to networks shared by contacts, and to hotspots offering paid services",
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/Wifi/AllowAutoConnectToWiFiSenseHotspots",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  0,
                            "isReadOnly":  false
                        },
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "bitlocker_ext_devices",
                            "description":  "Enumeration policy for external devices incompatible with Kernel DMA Protection",
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/DmaGuard/DeviceEnumerationPolicy",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  0,
                            "isReadOnly":  false
                        },
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "user_install_win_apps",
                            "description":  "Prevent non-admin users from installing packaged Windows apps",
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/ApplicationManagement/BlockNonAdminUserInstall",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  1,
                            "isReadOnly":  false
                        },
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "off_ms_experience",
                            "description":  "Turn off Microsoft consumer experiences",
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/Experience/AllowWindowsConsumerFeatures",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  0,
                            "isReadOnly":  false
                        }
                    ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceConfigurationAssignment",
                            "@odata.id":  "deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/assignments(\u0027379c94bb-054a-40d1-8889-c8e47f38d839_68243fc3-8f1f-4d0c-8afe-37769ba2de82\u0027)",
                            "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/assignments(\u0027379c94bb-054a-40d1-8889-c8e47f38d839_68243fc3-8f1f-4d0c-8afe-37769ba2de82\u0027)",
                            "id":  "379c94bb-054a-40d1-8889-c8e47f38d839_68243fc3-8f1f-4d0c-8afe-37769ba2de82",
                            "source@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentSource",
                            "source":  "direct",
                            "sourceId":  "379c94bb-054a-40d1-8889-c8e47f38d839",
                            "intent@odata.type":  "#microsoft.graph.deviceConfigAssignmentIntent",
                            "intent":  "apply",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "68243fc3-8f1f-4d0c-8afe-37769ba2de82"
                                       }
                        }
                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.windows10CustomConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027379c94bb-054a-40d1-8889-c8e47f38d839\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
