{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.macOSSoftwareUpdateConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration",
    "id":  "860f8cb6-d9ad-42c1-ab89-b36bf19660e7",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-06-02T05:58:27.101045Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-06-02T05:58:27.101045Z",
    "description":  null,
    "displayName":  "macOS - Default - Update policies - v3.0",
    "version":  1,
    "criticalUpdateBehavior@odata.type":  "#microsoft.graph.macOSSoftwareUpdateBehavior",
    "criticalUpdateBehavior":  "installLater",
    "configDataUpdateBehavior@odata.type":  "#microsoft.graph.macOSSoftwareUpdateBehavior",
    "configDataUpdateBehavior":  "installLater",
    "firmwareUpdateBehavior@odata.type":  "#microsoft.graph.macOSSoftwareUpdateBehavior",
    "firmwareUpdateBehavior":  "installLater",
    "allOtherUpdateBehavior@odata.type":  "#microsoft.graph.macOSSoftwareUpdateBehavior",
    "allOtherUpdateBehavior":  "installLater",
    "updateScheduleType@odata.type":  "#microsoft.graph.macOSSoftwareUpdateScheduleType",
    "updateScheduleType":  "alwaysUpdate",
    "updateTimeWindowUtcOffsetInMinutes":  null,
    "maxUserDeferralsCount":  5,
    "priority@odata.type":  "#microsoft.graph.macOSPriority",
    "priority":  "high",
    "customUpdateTimeWindows@odata.type":  "#Collection(microsoft.graph.customUpdateTimeWindow)",
    "customUpdateTimeWindows":  [

                                ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/assignments",
    "assignments":  [

                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.macOSSoftwareUpdateConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027860f8cb6-d9ad-42c1-ab89-b36bf19660e7\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
