{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceEnrollmentConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration",
    "@odata.id":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)",
    "@odata.editLink":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration",
    "id":  "06cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions",
    "displayName":  "All users and all devices",
    "description":  "This is the default Device Type Restriction applied with the lowest priority to all users regardless of group membership.",
    "priority":  0,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "0001-01-01T00:00:00Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-04-11T05:02:33Z",
    "version":  0,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [

                        ],
    "deviceEnrollmentConfigurationType@odata.type":  "#microsoft.graph.deviceEnrollmentConfigurationType",
    "deviceEnrollmentConfigurationType":  "platformRestrictions",
    "visionOSRestriction":  null,
    "tvosRestriction":  null,
    "iosRestriction":  {
                           "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                           "platformBlocked":  false,
                           "personalDeviceEnrollmentBlocked":  false,
                           "osMinimumVersion":  "",
                           "osMaximumVersion":  "",
                           "blockedManufacturers@odata.type":  "#Collection(String)",
                           "blockedManufacturers":  [

                                                    ],
                           "blockedSkus@odata.type":  "#Collection(String)",
                           "blockedSkus":  [

                                           ]
                       },
    "windowsRestriction":  {
                               "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                               "platformBlocked":  false,
                               "personalDeviceEnrollmentBlocked":  false,
                               "osMinimumVersion":  "",
                               "osMaximumVersion":  "",
                               "blockedManufacturers@odata.type":  "#Collection(String)",
                               "blockedManufacturers":  [

                                                        ],
                               "blockedSkus@odata.type":  "#Collection(String)",
                               "blockedSkus":  [

                                               ]
                           },
    "windowsHomeSkuRestriction":  {
                                      "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                                      "platformBlocked":  false,
                                      "personalDeviceEnrollmentBlocked":  false,
                                      "osMinimumVersion":  null,
                                      "osMaximumVersion":  null,
                                      "blockedManufacturers@odata.type":  "#Collection(String)",
                                      "blockedManufacturers":  [

                                                               ],
                                      "blockedSkus@odata.type":  "#Collection(String)",
                                      "blockedSkus":  [

                                                      ]
                                  },
    "windowsMobileRestriction":  {
                                     "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                                     "platformBlocked":  true,
                                     "personalDeviceEnrollmentBlocked":  false,
                                     "osMinimumVersion":  "",
                                     "osMaximumVersion":  "",
                                     "blockedManufacturers@odata.type":  "#Collection(String)",
                                     "blockedManufacturers":  [

                                                              ],
                                     "blockedSkus@odata.type":  "#Collection(String)",
                                     "blockedSkus":  [

                                                     ]
                                 },
    "androidRestriction":  {
                               "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                               "platformBlocked":  false,
                               "personalDeviceEnrollmentBlocked":  false,
                               "osMinimumVersion":  "",
                               "osMaximumVersion":  "",
                               "blockedManufacturers@odata.type":  "#Collection(String)",
                               "blockedManufacturers":  [

                                                        ],
                               "blockedSkus@odata.type":  "#Collection(String)",
                               "blockedSkus":  [

                                               ]
                           },
    "androidForWorkRestriction":  {
                                      "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                                      "platformBlocked":  false,
                                      "personalDeviceEnrollmentBlocked":  false,
                                      "osMinimumVersion":  "",
                                      "osMaximumVersion":  "",
                                      "blockedManufacturers@odata.type":  "#Collection(String)",
                                      "blockedManufacturers":  [

                                                               ],
                                      "blockedSkus@odata.type":  "#Collection(String)",
                                      "blockedSkus":  [

                                                      ]
                                  },
    "macRestriction":  {
                           "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                           "platformBlocked":  false,
                           "personalDeviceEnrollmentBlocked":  false,
                           "osMinimumVersion":  null,
                           "osMaximumVersion":  null,
                           "blockedManufacturers@odata.type":  "#Collection(String)",
                           "blockedManufacturers":  [

                                                    ],
                           "blockedSkus@odata.type":  "#Collection(String)",
                           "blockedSkus":  [

                                           ]
                       },
    "macOSRestriction":  {
                             "@odata.type":  "#microsoft.graph.deviceEnrollmentPlatformRestriction",
                             "platformBlocked":  false,
                             "personalDeviceEnrollmentBlocked":  false,
                             "osMinimumVersion":  null,
                             "osMaximumVersion":  null,
                             "blockedManufacturers@odata.type":  "#Collection(String)",
                             "blockedManufacturers":  [

                                                      ],
                             "blockedSkus@odata.type":  "#Collection(String)",
                             "blockedSkus":  [

                                             ]
                         },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.enrollmentConfigurationAssignment",
                            "@odata.id":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/assignments(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)",
                            "@odata.editLink":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/assignments(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)",
                            "id":  "06cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions",
                            "source@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentSource",
                            "source":  "direct",
                            "sourceId":  null,
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.allDevicesAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none"
                                       }
                        }
                    ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/microsoft.graph.deviceEnrollmentConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.setPriority":  {
                                         "title":  "microsoft.graph.setPriority",
                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultPlatformRestrictions\u0027)/microsoft.graph.deviceEnrollmentConfiguration/microsoft.graph.setPriority"
                                     }
}
