{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
    "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
    "@odata.id": "deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)",
    "@odata.editLink": "deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "id": "bd446e70-a49a-4504-b318-b39d02d590c8",
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-06-05T03:06:55.9216873Z",
    "description": null,
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-06-05T03:06:55.9216873Z",
    "displayName": "Company-Owned Android Enterprise Baseline - Sample",
    "version": 1,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
    "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
    "securityBlockJailbrokenDevices": false,
    "securityRequireSafetyNetAttestationBasicIntegrity": true,
    "securityRequireSafetyNetAttestationCertifiedDevice": false,
    "osMinimumVersion": null,
    "osMaximumVersion": null,
    "minAndroidSecurityPatchLevel": null,
    "passwordRequired": true,
    "passwordMinimumLength": 6,
    "passwordMinimumLetterCharacters": null,
    "passwordMinimumLowerCaseCharacters": null,
    "passwordMinimumNonLetterCharacters": null,
    "passwordMinimumNumericCharacters": null,
    "passwordMinimumSymbolCharacters": null,
    "passwordMinimumUpperCaseCharacters": null,
    "passwordRequiredType@odata.type": "#microsoft.graph.androidDeviceOwnerRequiredPasswordType",
    "passwordRequiredType": "numeric",
    "passwordMinutesOfInactivityBeforeLock": 5,
    "passwordExpirationDays": null,
    "passwordPreviousPasswordCountToBlock": null,
    "storageRequireEncryption": true,
    "securityRequireIntuneAppIntegrity": null,
    "requireNoPendingSystemUpdates": null,
    "securityRequiredAndroidSafetyNetEvaluationType": null,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/assignments",
    "assignments": [],
    "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
    "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule/$ref",
    "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule",
    "scheduledActionsForRule": [
        {
            "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
            "@odata.id": "deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionsForRule(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)",
            "@odata.editLink": "deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionsForRule(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)",
            "id": "bd446e70-a49a-4504-b318-b39d02d590c9",
            "ruleName": null,
            "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/scheduledActionsForRule(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionConfigurations",
            "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionsForRule(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionConfigurations/$ref",
            "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionsForRule(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionConfigurations",
            "scheduledActionConfigurations": [
                {
                    "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                    "@odata.id": "deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionsForRule(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionConfigurations(\u0027a8eb6b50-8480-4bb7-bd37-c37648cc8139\u0027)",
                    "@odata.editLink": "deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionsForRule(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/scheduledActionConfigurations(\u0027a8eb6b50-8480-4bb7-bd37-c37648cc8139\u0027)",
                    "id": "a8eb6b50-8480-4bb7-bd37-c37648cc8139",
                    "gracePeriodHours": 0,
                    "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
                    "actionType": "block",
                    "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                    "notificationMessageCCList@odata.type": "#Collection(String)",
                    "notificationMessageCCList": []
                }
            ]
        }
    ],
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/deviceStatusOverview",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.androidDeviceOwnerCompliancePolicy/userStatusOverview",
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
    },
    "#microsoft.graph.scheduleActionsForRules": {
        "title": "microsoft.graph.scheduleActionsForRules",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027bd446e70-a49a-4504-b318-b39d02d590c9\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
    }
}