{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
    "@odata.type":  "#microsoft.graph.iosCompliancePolicy",
    "@odata.id":  "deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)",
    "@odata.editLink":  "deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "b737f5d9-f288-4ac5-abe8-93226603ecb0",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-06-05T03:05:50.9516937Z",
    "description":  null,
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-06-05T03:05:50.9516937Z",
    "displayName":  "iOS/iPadOS Baseline",
    "version":  1,
    "passcodeBlockSimple":  true,
    "passcodeExpirationDays":  null,
    "passcodeMinimumLength":  6,
    "passcodeMinutesOfInactivityBeforeLock":  0,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  5,
    "passcodePreviousPasscodeBlockCount":  null,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodeRequiredType@odata.type":  "#microsoft.graph.requiredPasswordType",
    "passcodeRequiredType":  "numeric",
    "passcodeRequired":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "securityBlockJailbrokenDevices":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel@odata.type":  "#microsoft.graph.deviceThreatProtectionLevel",
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel@odata.type":  "#microsoft.graph.deviceThreatProtectionLevel",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "managedEmailProfileRequired":  false,
    "restrictedApps@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "restrictedApps":  [

                       ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/assignments",
    "assignments":  [

                    ],
    "scheduledActionsForRule@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
    "scheduledActionsForRule@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule/$ref",
    "scheduledActionsForRule@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule",
    "scheduledActionsForRule":  [
                                    {
                                        "@odata.type":  "#microsoft.graph.deviceComplianceScheduledActionForRule",
                                        "@odata.id":  "deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionsForRule(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)",
                                        "@odata.editLink":  "deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionsForRule(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)",
                                        "id":  "b737f5d9-f288-4ac5-abe8-93226603ecb0",
                                        "ruleName":  null,
                                        "scheduledActionConfigurations@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionConfigurations",
                                        "scheduledActionConfigurations@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionsForRule(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionConfigurations/$ref",
                                        "scheduledActionConfigurations@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionsForRule(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionConfigurations",
                                        "scheduledActionConfigurations":  [
                                                                              {
                                                                                  "@odata.type":  "#microsoft.graph.deviceComplianceActionItem",
                                                                                  "@odata.id":  "deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionsForRule(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionConfigurations(\u0027c42354ae-d3ac-4f18-8e23-cd71d2452a0f\u0027)",
                                                                                  "@odata.editLink":  "deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionsForRule(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/scheduledActionConfigurations(\u0027c42354ae-d3ac-4f18-8e23-cd71d2452a0f\u0027)",
                                                                                  "id":  "c42354ae-d3ac-4f18-8e23-cd71d2452a0f",
                                                                                  "gracePeriodHours":  0,
                                                                                  "actionType@odata.type":  "#microsoft.graph.deviceComplianceActionType",
                                                                                  "actionType":  "block",
                                                                                  "notificationTemplateId":  "00000000-0000-0000-0000-000000000000",
                                                                                  "notificationMessageCCList@odata.type":  "#Collection(String)",
                                                                                  "notificationMessageCCList":  [

                                                                                                                ]
                                                                              }
                                                                          ]
                                    }
                                ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/deviceStatusOverview",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.iosCompliancePolicy/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
                                },
    "#microsoft.graph.scheduleActionsForRules":  {
                                                     "title":  "microsoft.graph.scheduleActionsForRules",
                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027b737f5d9-f288-4ac5-abe8-93226603ecb0\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
                                                 }
}
