{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
    "@odata.type":  "#microsoft.graph.windows10CompliancePolicy",
    "@odata.id":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)",
    "@odata.editLink":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "128598b7-ca79-48ec-a1d6-b612ac6b1d56",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-07-09T00:05:36.6903036Z",
    "description":  null,
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-07-09T00:05:36.6903036Z",
    "displayName":  "WIN-Compliance_pilot_v1",
    "version":  1,
    "passwordRequired":  false,
    "passwordBlockSimple":  false,
    "passwordRequiredToUnlockFromIdle":  false,
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordRequiredType@odata.type":  "#microsoft.graph.requiredPasswordType",
    "passwordRequiredType":  "deviceDefault",
    "passwordPreviousPasswordBlockCount":  null,
    "requireHealthyDeviceReport":  false,
    "osMinimumVersion":  "10.0.19041",
    "osMaximumVersion":  null,
    "mobileOsMinimumVersion":  null,
    "mobileOsMaximumVersion":  null,
    "earlyLaunchAntiMalwareDriverEnabled":  false,
    "bitLockerEnabled":  false,
    "secureBootEnabled":  true,
    "codeIntegrityEnabled":  false,
    "memoryIntegrityEnabled":  false,
    "kernelDmaProtectionEnabled":  false,
    "virtualizationBasedSecurityEnabled":  false,
    "firmwareProtectionEnabled":  false,
    "storageRequireEncryption":  false,
    "activeFirewallRequired":  false,
    "defenderEnabled":  false,
    "defenderVersion":  null,
    "signatureOutOfDate":  false,
    "rtpEnabled":  false,
    "antivirusRequired":  false,
    "antiSpywareRequired":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel@odata.type":  "#microsoft.graph.deviceThreatProtectionLevel",
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "configurationManagerComplianceRequired":  false,
    "tpmRequired":  false,
    "deviceCompliancePolicyScript":  null,
    "validOperatingSystemBuildRanges@odata.type":  "#Collection(microsoft.graph.operatingSystemVersionRange)",
    "validOperatingSystemBuildRanges":  [

                                        ],
    "wslDistributions@odata.type":  "#Collection(microsoft.graph.wslDistributionConfiguration)",
    "wslDistributions":  [

                         ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceCompliancePolicyAssignment",
                            "@odata.id":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/assignments(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56_772cc75c-7891-4c1b-9d90-9116b888ef62\u0027)",
                            "@odata.editLink":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/assignments(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56_772cc75c-7891-4c1b-9d90-9116b888ef62\u0027)",
                            "id":  "128598b7-ca79-48ec-a1d6-b612ac6b1d56_772cc75c-7891-4c1b-9d90-9116b888ef62",
                            "source@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentSource",
                            "source":  "direct",
                            "sourceId":  "128598b7-ca79-48ec-a1d6-b612ac6b1d56",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "772cc75c-7891-4c1b-9d90-9116b888ef62"
                                       }
                        }
                    ],
    "scheduledActionsForRule@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
    "scheduledActionsForRule@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule/$ref",
    "scheduledActionsForRule@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule",
    "scheduledActionsForRule":  [
                                    {
                                        "@odata.type":  "#microsoft.graph.deviceComplianceScheduledActionForRule",
                                        "@odata.id":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionsForRule(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)",
                                        "@odata.editLink":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionsForRule(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)",
                                        "id":  "128598b7-ca79-48ec-a1d6-b612ac6b1d56",
                                        "ruleName":  null,
                                        "scheduledActionConfigurations@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionConfigurations",
                                        "scheduledActionConfigurations@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionsForRule(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionConfigurations/$ref",
                                        "scheduledActionConfigurations@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionsForRule(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionConfigurations",
                                        "scheduledActionConfigurations":  [
                                                                              {
                                                                                  "@odata.type":  "#microsoft.graph.deviceComplianceActionItem",
                                                                                  "@odata.id":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionsForRule(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionConfigurations(\u002777858dd4-54e6-4b8d-a74b-3464392de419\u0027)",
                                                                                  "@odata.editLink":  "deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionsForRule(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/scheduledActionConfigurations(\u002777858dd4-54e6-4b8d-a74b-3464392de419\u0027)",
                                                                                  "id":  "77858dd4-54e6-4b8d-a74b-3464392de419",
                                                                                  "gracePeriodHours":  0,
                                                                                  "actionType@odata.type":  "#microsoft.graph.deviceComplianceActionType",
                                                                                  "actionType":  "block",
                                                                                  "notificationTemplateId":  "00000000-0000-0000-0000-000000000000",
                                                                                  "notificationMessageCCList@odata.type":  "#Collection(String)",
                                                                                  "notificationMessageCCList":  [

                                                                                                                ]
                                                                              }
                                                                          ]
                                    }
                                ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.windows10CompliancePolicy/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
                                },
    "#microsoft.graph.scheduleActionsForRules":  {
                                                     "title":  "microsoft.graph.scheduleActionsForRules",
                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027128598b7-ca79-48ec-a1d6-b612ac6b1d56\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
                                                 }
}
