{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "@odata.id": "deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)",
    "@odata.editLink": "deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "id": "379ab50e-8a02-4169-b835-c995da0e36f4",
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-07-08T21:48:29.2908805Z",
    "description": null,
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-07-08T21:48:29.2908805Z",
    "displayName": "WIN-Compliance - Sample",
    "version": 1,
    "passwordRequired": false,
    "passwordBlockSimple": false,
    "passwordRequiredToUnlockFromIdle": false,
    "passwordMinutesOfInactivityBeforeLock": null,
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumCharacterSetCount": null,
    "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
    "passwordRequiredType": "deviceDefault",
    "passwordPreviousPasswordBlockCount": null,
    "requireHealthyDeviceReport": false,
    "osMinimumVersion": "10.0.19041",
    "osMaximumVersion": null,
    "mobileOsMinimumVersion": null,
    "mobileOsMaximumVersion": null,
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "bitLockerEnabled": false,
    "secureBootEnabled": true,
    "codeIntegrityEnabled": false,
    "memoryIntegrityEnabled": false,
    "kernelDmaProtectionEnabled": false,
    "virtualizationBasedSecurityEnabled": false,
    "firmwareProtectionEnabled": false,
    "storageRequireEncryption": false,
    "activeFirewallRequired": false,
    "defenderEnabled": false,
    "defenderVersion": null,
    "signatureOutOfDate": false,
    "rtpEnabled": false,
    "antivirusRequired": false,
    "antiSpywareRequired": false,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "configurationManagerComplianceRequired": false,
    "tpmRequired": false,
    "deviceCompliancePolicyScript": null,
    "validOperatingSystemBuildRanges@odata.type": "#Collection(microsoft.graph.operatingSystemVersionRange)",
    "validOperatingSystemBuildRanges": [],
    "wslDistributions@odata.type": "#Collection(microsoft.graph.wslDistributionConfiguration)",
    "wslDistributions": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/assignments",
    "assignments": [],
    "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
    "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule/$ref",
    "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule",
    "scheduledActionsForRule": [
        {
            "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
            "@odata.id": "deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionsForRule(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)",
            "@odata.editLink": "deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionsForRule(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)",
            "id": "379ab50e-8a02-4169-b835-c995da0e36f4",
            "ruleName": null,
            "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionConfigurations",
            "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionsForRule(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionConfigurations/$ref",
            "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionsForRule(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionConfigurations",
            "scheduledActionConfigurations": [
                {
                    "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                    "@odata.id": "deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionsForRule(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionConfigurations(\u00274b58f3db-53f0-4b45-8bc1-feb5486ebcc6\u0027)",
                    "@odata.editLink": "deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionsForRule(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/scheduledActionConfigurations(\u00274b58f3db-53f0-4b45-8bc1-feb5486ebcc6\u0027)",
                    "id": "4b58f3db-53f0-4b45-8bc1-feb5486ebcc6",
                    "gracePeriodHours": 0,
                    "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
                    "actionType": "block",
                    "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                    "notificationMessageCCList@odata.type": "#Collection(String)",
                    "notificationMessageCCList": []
                }
            ]
        }
    ],
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/deviceStatusOverview",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.windows10CompliancePolicy/userStatusOverview",
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
    },
    "#microsoft.graph.scheduleActionsForRules": {
        "title": "microsoft.graph.scheduleActionsForRules",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies(\u0027379ab50e-8a02-4169-b835-c995da0e36f4\u0027)/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
    }
}