{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)",
    "@odata.editLink": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)",
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-06-22T21:20:52.4636588Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-06-22T21:20:52.4636588Z",
    "name": "WIN - Device Guard - Sample",
    "platforms@odata.type": "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 5,
    "technologies@odata.type": "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies": "mdm",
    "id": "7428672e-c524-45ed-b4f8-b818a5815518",
    "templateReference": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
        "templateId": "",
        "templateFamily@odata.type": "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/assignments",
    "assignments": [],
    "settings@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings",
    "settings@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings/$ref",
    "settings@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings",
    "settings": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00270\u0027)",
            "@odata.editLink": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00270\u0027)",
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_configuresystemguardlaunch_0",
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            },
            "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
            "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00270\u0027)/settingDefinitions"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00271\u0027)",
            "@odata.editLink": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00271\u0027)",
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_0",
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            },
            "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
            "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00271\u0027)/settingDefinitions"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00272\u0027)",
            "@odata.editLink": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00272\u0027)",
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_enablevirtualizationbasedsecurity_0",
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            },
            "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
            "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00272\u0027)/settingDefinitions"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00273\u0027)",
            "@odata.editLink": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00273\u0027)",
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_machineidentityisolation",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_machineidentityisolation_0",
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            },
            "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
            "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00273\u0027)/settingDefinitions"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "@odata.id": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00274\u0027)",
            "@odata.editLink": "deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00274\u0027)",
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures_1",
                    "children@odata.type": "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                    "children": []
                }
            },
            "settingDefinitions@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
            "settingDefinitions@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/settings(\u00274\u0027)/settingDefinitions"
        }
    ],
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/microsoft.graph.assign"
    },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget": {
        "title": "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
    },
    "#microsoft.graph.createCopy": {
        "title": "microsoft.graph.createCopy",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/microsoft.graph.createCopy"
    },
    "#microsoft.graph.reorder": {
        "title": "microsoft.graph.reorder",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/microsoft.graph.reorder"
    },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget": {
        "title": "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
    },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget": {
        "title": "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
    },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy": {
        "title": "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
        "target": "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00277428672e-c524-45ed-b4f8-b818a5815518\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
    }
}