{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-07-09T21:09:45.1124154Z",
    "creationSource":  null,
    "description":  "",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-07-09T21:09:45.1124154Z",
    "name":  "Windows Security Policy_canary_v1",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  25,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "826467a4-e0f3-4446-a8f6-6d043c629db9",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/assignments",
    "assignments":  [
                        {
                            "id":  "826467a4-e0f3-4446-a8f6-6d043c629db9_68243fc3-8f1f-4d0c-8afe-37769ba2de82",
                            "source":  "direct",
                            "sourceId":  "826467a4-e0f3-4446-a8f6-6d043c629db9",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "68243fc3-8f1f-4d0c-8afe-37769ba2de82"
                                       }
                        }
                    ],
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "7c7dc01b-fbad-4476-bbd9-97d6fdd6f557"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "85f42e96-fbc8-44f7-8cdf-83d645e215e0",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "d4af93ed-8a54-4ce3-8468-e53486d58657"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "d26fde39-5e4d-4f2f-8c49-641033edbd60",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "a6c2cdd6-2c52-4548-b9c7-a1921fcf4717"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "443c4209-0973-41b3-bccb-bbbc3d5a81a3",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00273\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00273\u0027)",
                         "id":  "3",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "4edbc00f-ea59-4c76-83db-be2f300d1c00"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "56202f91-eee8-4c14-b3e9-c4b7e72c28d8",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "5d3a1cbc-ce3e-4937-899b-81a7615b4982"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver_4",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "7b3823db-9ce0-4c46-8282-da2de3396551",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00273\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00274\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00274\u0027)",
                         "id":  "4",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "3582c437-7f7d-41da-be48-f6cc875d74dc"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "860c2e23-7eaa-4735-97fb-058eae5b8719",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00274\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00275\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00275\u0027)",
                         "id":  "5",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "861c39fc-9eef-4070-982d-6c062a28ca11"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "3f96c091-58d3-456f-9e4b-9fd18e950f9e",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00275\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00275\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00276\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00276\u0027)",
                         "id":  "6",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "96885e58-34ab-468d-8444-d0f91fbf10d0"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "bbe0fb65-31ca-4f87-9d2d-cdc95ade5b48",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00276\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00276\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00277\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00277\u0027)",
                         "id":  "7",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "d26001a0-5e2d-4f45-94f6-a8fb15b016d8"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "a2ff7ae1-ed74-4c1c-89a0-e22febeb44cd",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "087f2d64-b645-45ff-b820-8b071e321cde"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "f4e884b8-1fb3-4352-a72d-0866307b9dbe",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00277\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00277\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00278\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00278\u0027)",
                         "id":  "8",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "3e5238aa-9ccc-45ed-8d94-a5a13c9ead63"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "a01e5ce1-378d-4a51-97ee-54568cb4b157",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "fc9ef55d-dd87-432e-9ab5-8cb709e3beee"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting_2",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "3df42274-1de8-47a4-9943-bc94e0222758",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00278\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00278\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00279\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00279\u0027)",
                         "id":  "9",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "e8b666cf-ae2f-48d8-bb52-0003244da18a"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes_0",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "c621460a-7722-47da-9a92-3abb93fab0be",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00279\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u00279\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002710\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002710\u0027)",
                         "id":  "10",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "ec6ff1d8-f6f0-4476-b2ba-a300402ca625"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "1a9b1e9b-b9ab-485a-b5dd-93377b1b5ee8",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002710\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002710\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002711\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002711\u0027)",
                         "id":  "11",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "c2beaa88-fa59-4f55-99bf-a87e83d0e40e"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "dca2e64b-118f-48f5-af56-1e5f26e4e496",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002711\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002711\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002712\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002712\u0027)",
                         "id":  "12",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "fd9e16e7-3362-4849-bdd9-347f0eb2f013"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "658d04ad-6c76-440d-b30c-0c3304f421ec",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002712\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002712\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002713\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002713\u0027)",
                         "id":  "13",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_hardeneduncpaths",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "6bc0d23e-0338-45a7-a7a1-26c91052e3e0"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "579dd0e4-ad38-417d-9685-d7dd1b467811",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "c7a421c5-c3e1-4dfd-838b-4d13cd0a2a08"
                                                                                                                                      },
                                                                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                 "groupSettingCollectionValue":  [
                                                                                                                                     {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [
                                                                                                                                                          {
                                                                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                                                                                                                                                              "settingInstanceTemplateReference":  {
                                                                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                                                                                       "settingInstanceTemplateId":  "1b15b254-b280-4b38-b22e-fe3ca5af7c70"
                                                                                                                                                                                                   },
                                                                                                                                                              "simpleSettingValue":  {
                                                                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                         "value":  "RequireMutualAuthentication=1,RequireIntegrity=1",
                                                                                                                                                                                         "settingValueTemplateReference":  {
                                                                                                                                                                                                                               "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                                                                               "settingValueTemplateId":  "aa4e239c-f452-4020-a01c-f705b5ba9a40",
                                                                                                                                                                                                                               "useTemplateDefault":  false
                                                                                                                                                                                                                           }
                                                                                                                                                                                     }
                                                                                                                                                          },
                                                                                                                                                          {
                                                                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                                                                                                                                                              "settingInstanceTemplateReference":  {
                                                                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                                                                                       "settingInstanceTemplateId":  "26f010c1-bc61-42af-9b97-e77fc4181512"
                                                                                                                                                                                                   },
                                                                                                                                                              "simpleSettingValue":  {
                                                                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                         "value":  "\\\\*\\SYSVOL",
                                                                                                                                                                                         "settingValueTemplateReference":  {
                                                                                                                                                                                                                               "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                                                                               "settingValueTemplateId":  "931398fa-cf2a-4e3d-bf8c-36fda21a1925",
                                                                                                                                                                                                                               "useTemplateDefault":  false
                                                                                                                                                                                                                           }
                                                                                                                                                                                     }
                                                                                                                                                          }
                                                                                                                                                      ]
                                                                                                                                     },
                                                                                                                                     {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [
                                                                                                                                                          {
                                                                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                                                                                                                                                              "settingInstanceTemplateReference":  {
                                                                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                                                                                       "settingInstanceTemplateId":  "2aa5902e-bc4f-4e98-9deb-582f226cd64c"
                                                                                                                                                                                                   },
                                                                                                                                                              "simpleSettingValue":  {
                                                                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                         "value":  "RequireMutualAuthentication=1,RequireIntegrity=1",
                                                                                                                                                                                         "settingValueTemplateReference":  {
                                                                                                                                                                                                                               "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                                                                               "settingValueTemplateId":  "90233d64-60b6-4c8a-8c6c-555604f94b55",
                                                                                                                                                                                                                               "useTemplateDefault":  false
                                                                                                                                                                                                                           }
                                                                                                                                                                                     }
                                                                                                                                                          },
                                                                                                                                                          {
                                                                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                              "settingDefinitionId":  "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                                                                                                                                                              "settingInstanceTemplateReference":  {
                                                                                                                                                                                                       "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                                                                                       "settingInstanceTemplateId":  "1cbb4781-392f-44d1-8660-eb05d5b18b0e"
                                                                                                                                                                                                   },
                                                                                                                                                              "simpleSettingValue":  {
                                                                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                         "value":  "\\\\*\\NETLOGON",
                                                                                                                                                                                         "settingValueTemplateReference":  {
                                                                                                                                                                                                                               "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                                                                               "settingValueTemplateId":  "b1997627-00d3-46b0-9ac1-533b16cee206",
                                                                                                                                                                                                                               "useTemplateDefault":  false
                                                                                                                                                                                                                           }
                                                                                                                                                                                     }
                                                                                                                                                          }
                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                                                 ]
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002713\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002713\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002714\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002714\u0027)",
                         "id":  "14",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "787c60ff-a23f-4843-985f-5a537c0508cf"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "eef724ca-465a-43bf-9b7e-fa18e3ec128a",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002714\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002714\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002715\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002715\u0027)",
                         "id":  "15",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "8203e137-23e9-4060-92e8-ecd45dd6e63e"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "84dcb49d-06e7-469a-9119-2b2d8c82d9f3",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "ec55a527-ce66-42eb-a449-9966e63b822f"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "a055ad15-a86a-4c10-91a3-bf4e5cf9aefe",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002715\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002715\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002716\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002716\u0027)",
                         "id":  "16",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "83bda0a1-db1b-4fcb-ad7a-ab5b1635bb80"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "911bc668-aca7-40f8-920e-f70b35e052b2",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "f06e3c57-3493-4b72-ac34-71ac856eb52a"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum_0",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "9b2bd846-f46b-4c88-941f-7e835e98ec97",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "6bb9775f-7b64-414d-93ad-d612270ef817"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum_0",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "a64aba40-2334-4e0e-ba5e-c2568be53204",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002716\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002716\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002717\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002717\u0027)",
                         "id":  "17",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "49a5e54e-685c-4c33-898d-d06db872bc67"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "7d8ffd7f-4abc-4e2d-9ae9-5f47103fda44",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "0c505b3a-b1f3-4963-948a-e45ec4e04ee7"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum_5",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "09bd0f47-8b2d-4518-8328-785345a22221",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "79479349-3107-47ac-942e-0153ee655a2e"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum_0",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "394ffdbf-1a51-4e2e-988d-5b187344dbc4",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002717\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002717\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002718\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002718\u0027)",
                         "id":  "18",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpctcpport",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "ae93831c-e0a2-4481-a5a0-35ac7ca5d582"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_printers_configurerpctcpport_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "1cde5600-1862-41f4-90c5-d1f5b5bdbac3",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurerpctcpport_rpctcpport",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "c579c06a-37c2-41e8-989d-ee7645fbb4c8"
                                                                                                                                      },
                                                                                                 "simpleSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                            "value":  0,
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "51da7e44-cf39-4880-b3b2-8b40a4e4bb5e",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              }
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002718\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002718\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002719\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002719\u0027)",
                         "id":  "19",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "66b2729a-5232-4bb3-9106-7cf17f29df14"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "843603d7-5624-45d4-8990-81da10cb97a6",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002719\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002719\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002720\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002720\u0027)",
                         "id":  "20",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurecopyfilespolicy",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "333f196c-6067-46a0-84a8-e343f297ce24"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "8052e4ca-bb3e-42f3-aeff-bedccd112567",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "89cb9227-10a6-49b5-9fb6-b6c03996feac"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "e6b871f6-75c1-43ba-85f0-d3f25b68f3d1",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002720\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002720\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002721\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002721\u0027)",
                         "id":  "21",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "8fa65f3d-a89a-4a03-a4e8-af26f55cd8bf"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "69133b32-d460-4f1e-a573-ca09aef142c9",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002721\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002721\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002722\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002722\u0027)",
                         "id":  "22",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "952d951e-92af-4eda-9424-26c06308dda3"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "a4e0fbd3-202c-4874-9a8b-d4b56050ad99",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "d9e03c33-c6c1-4644-982f-41046fd4fc5d"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_admx_credssp_allowencryptionoracle_allowencryptionoracledrop_0",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "66a96d0c-3a4f-4e25-b443-423c0aa42788",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002722\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002722\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002723\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002723\u0027)",
                         "id":  "23",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "1159aa66-0335-4f49-b6ca-29a3453f0d64"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_credentialsdelegation_remotehostallowsdelegationofnonexportablecredentials_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "63588f93-c0ec-4561-af47-f6437b12f843",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002723\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002723\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002724\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002724\u0027)",
                         "id":  "24",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses",
                                                 "settingInstanceTemplateReference":  {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                          "settingInstanceTemplateId":  "f4255e50-3ae1-4973-873a-2c7cf325a306"
                                                                                      },
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "value":  "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_1",
                                                                            "settingValueTemplateReference":  {
                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                  "settingValueTemplateId":  "5df53c06-432c-4284-9596-59e1c6ddea2c",
                                                                                                                  "useTemplateDefault":  false
                                                                                                              },
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "949fd962-f769-4f76-93b0-bd1f5b01348d"
                                                                                                                                      },
                                                                                                 "choiceSettingValue":  {
                                                                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                            "value":  "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive_1",
                                                                                                                            "settingValueTemplateReference":  {
                                                                                                                                                                  "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingValueTemplateReference",
                                                                                                                                                                  "settingValueTemplateId":  "025b4cb6-64e8-4347-91c8-58d0a7e483fe",
                                                                                                                                                                  "useTemplateDefault":  false
                                                                                                                                                              },
                                                                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                            "children":  [

                                                                                                                                         ]
                                                                                                                        }
                                                                                             },
                                                                                             {
                                                                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_list",
                                                                                                 "settingInstanceTemplateReference":  {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSettingInstanceTemplateReference",
                                                                                                                                          "settingInstanceTemplateId":  "e1922cc8-c5ac-4c12-b03f-91c6269ac072"
                                                                                                                                      },
                                                                                                 "simpleSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
                                                                                                 "simpleSettingCollectionValue":  [
                                                                                                                                      {
                                                                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                          "settingValueTemplateReference":  null,
                                                                                                                                          "value":  "{d48179be-ec20-11d1-b6b8-00c04fa372a7}"
                                                                                                                                      }
                                                                                                                                  ]
                                                                                             }
                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002724\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/settings(\u002724\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027826467a4-e0f3-4446-a8f6-6d043c629db9\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
