{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceEnrollmentConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windows10EnrollmentCompletionPageConfiguration",
    "@odata.id":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)",
    "@odata.editLink":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/microsoft.graph.windows10EnrollmentCompletionPageConfiguration",
    "id":  "06cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration",
    "displayName":  "All users and all devices",
    "description":  "This is the default enrollment status screen configuration applied with the lowest priority to all users and all devices regardless of group membership.",
    "priority":  0,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "0001-01-01T00:00:00Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-04-11T05:02:33Z",
    "version":  0,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [

                        ],
    "deviceEnrollmentConfigurationType@odata.type":  "#microsoft.graph.deviceEnrollmentConfigurationType",
    "deviceEnrollmentConfigurationType":  "windows10EnrollmentCompletionPageConfiguration",
    "showInstallationProgress":  true,
    "blockDeviceSetupRetryByUser":  false,
    "allowDeviceResetOnInstallFailure":  false,
    "allowLogCollectionOnInstallFailure":  true,
    "customErrorMessage":  "Setup could not be completed. Please try again or contact your support person for help.",
    "installProgressTimeoutInMinutes":  30,
    "allowDeviceUseOnInstallFailure":  false,
    "selectedMobileAppIds@odata.type":  "#Collection(String)",
    "selectedMobileAppIds":  [

                             ],
    "allowNonBlockingAppInstallation":  false,
    "installQualityUpdates":  false,
    "trackInstallProgressForAutopilotOnly":  true,
    "disableUserStatusTrackingAfterFirstUser":  true,
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/microsoft.graph.windows10EnrollmentCompletionPageConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/microsoft.graph.windows10EnrollmentCompletionPageConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/microsoft.graph.windows10EnrollmentCompletionPageConfiguration/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.enrollmentConfigurationAssignment",
                            "@odata.id":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/assignments(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)",
                            "@odata.editLink":  "deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/assignments(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)",
                            "id":  "06cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration",
                            "source@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentSource",
                            "source":  "direct",
                            "sourceId":  null,
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.allDevicesAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none"
                                       }
                        }
                    ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/microsoft.graph.deviceEnrollmentConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.setPriority":  {
                                         "title":  "microsoft.graph.setPriority",
                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations(\u002706cb13bb-b90e-4dff-997e-7247c59dc162_DefaultWindows10EnrollmentCompletionPageConfiguration\u0027)/microsoft.graph.deviceEnrollmentConfiguration/microsoft.graph.setPriority"
                                     }
}
