{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(categories(),assignments())/$entity",
    "@odata.type":  "#microsoft.graph.winGetApp",
    "id":  "8a4f0654-b45f-45b8-b21c-93db3066b5c7",
    "displayName":  "Microsoft 365 Copilot",
    "description":  "The Microsoft 365 Copilot app is your everyday productivity app for work and life. It helps you find, create, share, and save your content all in one place with Copilot*, Word, Excel, PowerPoint, and more. Just sign in with your work, school, or personal Microsoft account to start using the free desktop app today. (Formerly the Microsoft 365 (Office) app)\n\nWith Copilot for work, easily ask, create, and draft in a simplified chat experience to boost productivity. Reimagine how you collaborate with AI using Copilot Pages—a dynamic canvas grounded in web and your work data to streamline your everyday tasks.\n\n*Copilot Chat in the Microsoft 365 Copilot app is available for Microsoft 365 Enterprise, Academic, and SMB subscribers with a work or education account. Microsoft 365 Personal and Family subscribers and free accounts can access Microsoft Copilot at copilot.microsoft.com and on the Copilot mobile app. It is available in these specific markets: https://support.microsoft.com/en-us/office/supported-languages-for-microsoft-copilot-94518d61-644b-4118-9492-617eea4801d8.",
    "publisher":  "Microsoft Corporation",
    "largeIcon":  null,
    "createdDateTime":  "2025-06-02T01:38:19.1575447Z",
    "lastModifiedDateTime":  "2025-06-02T01:38:19.1575447Z",
    "isFeatured":  false,
    "privacyInformationUrl":  "http://go.microsoft.com/fwlink/?LinkID=521839",
    "informationUrl":  null,
    "owner":  "",
    "developer":  "",
    "notes":  "",
    "uploadState":  1,
    "publishingState":  "published",
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "manifestHash":  null,
    "packageIdentifier":  "9WZDNCRD29V9",
    "installExperience":  {
                              "runAsAccount":  "user"
                          },
    "categories":  [

                   ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(\u00278a4f0654-b45f-45b8-b21c-93db3066b5c7\u0027)/microsoft.graph.winGetApp/assignments",
    "assignments":  [
                        {
                            "id":  "acacacac-9df4-4c7d-9d50-4ef0226f57a9_0_0",
                            "intent":  "available",
                            "source":  "direct",
                            "sourceId":  null,
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.allLicensedUsersAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType":  "none"
                                       },
                            "settings":  {
                                             "@odata.type":  "#microsoft.graph.winGetAppAssignmentSettings",
                                             "notifications":  "showAll",
                                             "restartSettings":  null,
                                             "installTimeSettings":  null
                                         }
                        }
                    ]
}
