{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(categories(),assignments())/$entity",
    "@odata.type":  "#microsoft.graph.managedAndroidStoreApp",
    "id":  "f419e39a-48ee-410e-a4a3-10d210899fe3",
    "displayName":  "Microsoft Outlook",
    "description":  "“Its Outlook app for iOS and Android is the best mobile email app, no matter what phone you’re using. It’s better than Mail, better than Gmail.” - WIRED\r\n\r\nMeet Outlook for Android, the app that helps millions of users connect all their email accounts, calendars and files in one convenient spot. Newly redesigned, Outlook for Android lets you do more from one powerful inbox. \r\n\r\nSee what matters most first with the Focused inbox that keeps the important messages on top. Switch between your emails and calendar to schedule your next meeting or share your availability with just a few taps. Or grab a document from your Files list and attach it to an email seamlessly. \r\n\r\nWith everything you need only a tap away, managing your busy days is now easier than ever. \r\n\r\nOutlook for Android works with Microsoft Exchange, Office 365, Outlook.com, Gmail and Yahoo Mail.\r\n\r\n------------------------------\r\n\r\nHere’s what you’ll love about Outlook for Android:\r\n\r\n• Seamless inbox management with a focused inbox that displays your most important messages first, swipe gestures and smart filters. \r\n\r\n• Easy access to calendar and files right from your inbox. \r\n\r\n• Features to work on the go, like Word, Excel and PowerPoint integrations.",
    "publisher":  "Microsoft Corporation",
    "largeIcon":  null,
    "createdDateTime":  "2025-04-19T19:58:09.5758917Z",
    "lastModifiedDateTime":  "2025-04-19T19:58:09.5758917Z",
    "isFeatured":  false,
    "privacyInformationUrl":  null,
    "informationUrl":  null,
    "owner":  null,
    "developer":  null,
    "notes":  null,
    "uploadState":  1,
    "publishingState":  "published",
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "appAvailability":  "lineOfBusiness",
    "version":  "\"9101a4bc-0000-0100-0000-680400510000\"",
    "packageId":  "com.microsoft.office.outlook",
    "appStoreUrl":  "https://play.google.com/store/apps/details?id=com.microsoft.office.outlook",
    "minimumSupportedOperatingSystem":  {
                                            "v4_0":  true,
                                            "v4_0_3":  false,
                                            "v4_1":  false,
                                            "v4_2":  false,
                                            "v4_3":  false,
                                            "v4_4":  false,
                                            "v5_0":  false,
                                            "v5_1":  false,
                                            "v6_0":  false,
                                            "v7_0":  false,
                                            "v7_1":  false,
                                            "v8_0":  false,
                                            "v8_1":  false,
                                            "v9_0":  false,
                                            "v10_0":  false,
                                            "v11_0":  false,
                                            "v12_0":  false,
                                            "v13_0":  false,
                                            "v14_0":  false,
                                            "v15_0":  false
                                        },
    "categories":  [

                   ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(\u0027f419e39a-48ee-410e-a4a3-10d210899fe3\u0027)/microsoft.graph.managedAndroidStoreApp/assignments",
    "assignments":  [

                    ]
}
