{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(categories(),assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsMicrosoftEdgeApp",
    "id":  "0cfb973b-1732-4201-94ad-254f79cf0b3e",
    "displayName":  "Microsoft Edge for Windows 10",
    "description":  "Microsoft Edge is the browser for business with modern and legacy web compatibility, new privacy features such as Tracking prevention, and built-in productivity tools such as enterprise-grade PDF support and access to Office and corporate search right from a new tab.",
    "publisher":  "Microsoft",
    "largeIcon":  null,
    "createdDateTime":  "2024-09-02T19:04:48.7737431Z",
    "lastModifiedDateTime":  "2024-09-02T19:04:48.7737431Z",
    "isFeatured":  false,
    "privacyInformationUrl":  "https://privacy.microsoft.com/en-US/privacystatement",
    "informationUrl":  "https://www.microsoft.com/en-us/windows/microsoft-edge",
    "owner":  null,
    "developer":  "Microsoft",
    "notes":  null,
    "uploadState":  1,
    "publishingState":  "published",
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "channel":  "stable",
    "displayLanguageLocale":  null,
    "categories":  [

                   ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(\u00270cfb973b-1732-4201-94ad-254f79cf0b3e\u0027)/microsoft.graph.windowsMicrosoftEdgeApp/assignments",
    "assignments":  [

                    ]
}
