{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration",
    "id":  "e92339b4-9bc1-41dd-9259-1998514cbfb6",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-07-09T15:08:50.3482834Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-07-09T15:08:50.3482834Z",
    "description":  null,
    "displayName":  "Disable Windows Copilot using Intune",
    "version":  1,
    "omaSettings@odata.type":  "#Collection(microsoft.graph.omaSetting)",
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "TurnOffWindowsCopilot",
                            "description":  "Disable Copilot on Windows devices",
                            "omaUri":  "./User/Vendor/MSFT/Policy/Config/WindowsAI/TurnOffWindowsCopilot",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  1,
                            "isReadOnly":  false
                        }
                    ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments":  [

                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.windows10CustomConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027e92339b4-9bc1-41dd-9259-1998514cbfb6\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
