{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.macOSGeneralDeviceConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration",
    "id":  "6fcc4016-e615-4a24-82e0-1a7b537b4d8a",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-06-02T05:58:27.2314164Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-06-02T05:58:27.2314164Z",
    "description":  "",
    "displayName":  "MacOS - Device restrictions",
    "version":  1,
    "compliantAppListType@odata.type":  "#microsoft.graph.appListType",
    "compliantAppListType":  "none",
    "emailInDomainSuffixes@odata.type":  "#Collection(String)",
    "emailInDomainSuffixes":  [

                              ],
    "passwordBlockSimple":  true,
    "passwordExpirationDays":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordMinimumLength":  4,
    "passwordMinutesOfInactivityBeforeLock":  0,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  10,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordRequiredType@odata.type":  "#microsoft.graph.requiredPasswordType",
    "passwordRequiredType":  "deviceDefault",
    "passwordRequired":  true,
    "passwordMaximumAttemptCount":  null,
    "passwordMinutesUntilFailedLoginReset":  null,
    "keychainBlockCloudSync":  false,
    "safariBlockAutofill":  false,
    "cameraBlocked":  false,
    "iTunesBlockMusicService":  false,
    "spotlightBlockInternetResults":  false,
    "keyboardBlockDictation":  false,
    "definitionLookupBlocked":  false,
    "appleWatchBlockAutoUnlock":  false,
    "iTunesBlockFileSharing":  false,
    "iCloudBlockDocumentSync":  false,
    "iCloudBlockMail":  false,
    "iCloudBlockAddressBook":  false,
    "iCloudBlockCalendar":  false,
    "iCloudBlockReminders":  false,
    "iCloudBlockBookmarks":  false,
    "iCloudBlockNotes":  false,
    "airDropBlocked":  false,
    "passwordBlockModification":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockAutoFill":  false,
    "passwordBlockProximityRequests":  false,
    "passwordBlockAirDropSharing":  false,
    "softwareUpdatesEnforcedDelayInDays":  null,
    "updateDelayPolicy":  null,
    "contentCachingBlocked":  false,
    "iCloudBlockPhotoLibrary":  false,
    "screenCaptureBlocked":  false,
    "classroomAppBlockRemoteScreenObservation":  false,
    "classroomAppForceUnpromptedScreenObservation":  false,
    "classroomForceAutomaticallyJoinClasses":  false,
    "classroomForceRequestPermissionToLeaveClasses":  false,
    "classroomForceUnpromptedAppAndDeviceLock":  false,
    "iCloudBlockActivityContinuation":  false,
    "addingGameCenterFriendsBlocked":  false,
    "gameCenterBlocked":  false,
    "multiplayerGamingBlocked":  false,
    "wallpaperModificationBlocked":  false,
    "eraseContentAndSettingsBlocked":  false,
    "softwareUpdateMajorOSDeferredInstallDelayInDays":  null,
    "softwareUpdateMinorOSDeferredInstallDelayInDays":  null,
    "softwareUpdateNonOSDeferredInstallDelayInDays":  null,
    "touchIdTimeoutInHours":  null,
    "iCloudPrivateRelayBlocked":  false,
    "iCloudDesktopAndDocumentsBlocked":  false,
    "activationLockWhenSupervisedAllowed":  false,
    "compliantAppsList@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "compliantAppsList":  [

                          ],
    "privacyAccessControls@odata.type":  "#Collection(microsoft.graph.macOSPrivacyAccessControlItem)",
    "privacyAccessControls":  [

                              ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/assignments",
    "assignments":  [

                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.macOSGeneralDeviceConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00276fcc4016-e615-4a24-82e0-1a7b537b4d8a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
