{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments(),microsoft.graph.windows10GeneralConfiguration/privacyAccessControls())/$entity",
    "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
    "@odata.id": "deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)",
    "@odata.editLink": "deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration",
    "id": "c7315b51-038b-43f5-a4e8-f69bfcac7a6a",
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-07-06T17:49:06.2062737Z",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-07-06T17:49:06.2062737Z",
    "description": null,
    "displayName": "WIN-Restrictions - Sample",
    "version": 1,
    "taskManagerBlockEndTask": false,
    "energySaverOnBatteryThresholdPercentage": null,
    "energySaverPluggedInThresholdPercentage": null,
    "powerLidCloseActionOnBattery@odata.type": "#microsoft.graph.powerActionType",
    "powerLidCloseActionOnBattery": "notConfigured",
    "powerLidCloseActionPluggedIn@odata.type": "#microsoft.graph.powerActionType",
    "powerLidCloseActionPluggedIn": "notConfigured",
    "powerButtonActionOnBattery@odata.type": "#microsoft.graph.powerActionType",
    "powerButtonActionOnBattery": "notConfigured",
    "powerButtonActionPluggedIn@odata.type": "#microsoft.graph.powerActionType",
    "powerButtonActionPluggedIn": "notConfigured",
    "powerSleepButtonActionOnBattery@odata.type": "#microsoft.graph.powerActionType",
    "powerSleepButtonActionOnBattery": "notConfigured",
    "powerSleepButtonActionPluggedIn@odata.type": "#microsoft.graph.powerActionType",
    "powerSleepButtonActionPluggedIn": "notConfigured",
    "powerHybridSleepOnBattery@odata.type": "#microsoft.graph.enablement",
    "powerHybridSleepOnBattery": "notConfigured",
    "powerHybridSleepPluggedIn@odata.type": "#microsoft.graph.enablement",
    "powerHybridSleepPluggedIn": "notConfigured",
    "windows10AppsForceUpdateSchedule": null,
    "enableAutomaticRedeployment": false,
    "microsoftAccountSignInAssistantSettings@odata.type": "#microsoft.graph.signInAssistantOptions",
    "microsoftAccountSignInAssistantSettings": "notConfigured",
    "authenticationAllowSecondaryDevice": false,
    "authenticationWebSignIn@odata.type": "#microsoft.graph.enablement",
    "authenticationWebSignIn": "notConfigured",
    "authenticationPreferredAzureADTenantDomainName": null,
    "cryptographyAllowFipsAlgorithmPolicy": false,
    "displayAppListWithGdiDPIScalingTurnedOn@odata.type": "#Collection(String)",
    "displayAppListWithGdiDPIScalingTurnedOn": [],
    "displayAppListWithGdiDPIScalingTurnedOff@odata.type": "#Collection(String)",
    "displayAppListWithGdiDPIScalingTurnedOff": [],
    "enterpriseCloudPrintDiscoveryEndPoint": null,
    "enterpriseCloudPrintOAuthAuthority": null,
    "enterpriseCloudPrintOAuthClientIdentifier": null,
    "enterpriseCloudPrintResourceIdentifier": null,
    "enterpriseCloudPrintDiscoveryMaxLimit": null,
    "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier": null,
    "experienceDoNotSyncBrowserSettings@odata.type": "#microsoft.graph.browserSyncSetting",
    "experienceDoNotSyncBrowserSettings": "notConfigured",
    "messagingBlockSync": false,
    "messagingBlockMMS": false,
    "messagingBlockRichCommunicationServices": false,
    "printerNames@odata.type": "#Collection(String)",
    "printerNames": [],
    "printerDefaultName": null,
    "printerBlockAddition": false,
    "searchBlockDiacritics": false,
    "searchDisableAutoLanguageDetection": false,
    "searchDisableIndexingEncryptedItems": false,
    "searchEnableRemoteQueries": false,
    "searchDisableUseLocation": false,
    "searchDisableLocation": false,
    "searchDisableIndexerBackoff": false,
    "searchDisableIndexingRemovableDrive": false,
    "searchEnableAutomaticIndexSizeManangement": false,
    "searchBlockWebResults": false,
    "findMyFiles@odata.type": "#microsoft.graph.enablement",
    "findMyFiles": "notConfigured",
    "securityBlockAzureADJoinedDevicesAutoEncryption": false,
    "diagnosticsDataSubmissionMode@odata.type": "#microsoft.graph.diagnosticDataSubmissionMode",
    "diagnosticsDataSubmissionMode": "userDefined",
    "oneDriveDisableFileSync": false,
    "systemTelemetryProxyServer": null,
    "edgeTelemetryForMicrosoft365Analytics@odata.type": "#microsoft.graph.edgeTelemetryMode",
    "edgeTelemetryForMicrosoft365Analytics": "notConfigured",
    "inkWorkspaceAccess@odata.type": "#microsoft.graph.inkAccessSetting",
    "inkWorkspaceAccess": "notConfigured",
    "inkWorkspaceAccessState@odata.type": "#microsoft.graph.stateManagementSetting",
    "inkWorkspaceAccessState": "notConfigured",
    "inkWorkspaceBlockSuggestedApps": false,
    "smartScreenEnableAppInstallControl": false,
    "smartScreenAppInstallControl@odata.type": "#microsoft.graph.appInstallControlType",
    "smartScreenAppInstallControl": "notConfigured",
    "personalizationDesktopImageUrl": "https://www.jorgeasaur.us/content/images/2023/05/echo_park2_crop.png",
    "personalizationLockScreenImageUrl": "https://www.jorgeasaur.us/content/images/2023/05/echo_park2_crop.png",
    "bluetoothAllowedServices@odata.type": "#Collection(String)",
    "bluetoothAllowedServices": [],
    "bluetoothBlockAdvertising": false,
    "bluetoothBlockPromptedProximalConnections": false,
    "bluetoothBlockDiscoverableMode": false,
    "bluetoothBlockPrePairing": false,
    "edgeBlockAutofill": false,
    "edgeBlocked": false,
    "edgeCookiePolicy@odata.type": "#microsoft.graph.edgeCookiePolicy",
    "edgeCookiePolicy": "userDefined",
    "edgeBlockDeveloperTools": false,
    "edgeBlockSendingDoNotTrackHeader": false,
    "edgeBlockExtensions": false,
    "edgeBlockInPrivateBrowsing": false,
    "edgeBlockJavaScript": false,
    "edgeBlockPasswordManager": false,
    "edgeBlockAddressBarDropdown": false,
    "edgeBlockCompatibilityList": false,
    "edgeClearBrowsingDataOnExit": false,
    "edgeAllowStartPagesModification": false,
    "edgeDisableFirstRunPage": false,
    "edgeBlockLiveTileDataCollection": false,
    "edgeSyncFavoritesWithInternetExplorer": false,
    "edgeFavoritesListLocation": null,
    "edgeBlockEditFavorites": false,
    "edgeNewTabPageURL": null,
    "edgeHomeButtonConfiguration": null,
    "edgeHomeButtonConfigurationEnabled": false,
    "edgeOpensWith@odata.type": "#microsoft.graph.edgeOpenOptions",
    "edgeOpensWith": "notConfigured",
    "edgeBlockSideloadingExtensions": false,
    "edgeRequiredExtensionPackageFamilyNames@odata.type": "#Collection(String)",
    "edgeRequiredExtensionPackageFamilyNames": [],
    "edgeBlockPrinting": false,
    "edgeFavoritesBarVisibility@odata.type": "#microsoft.graph.visibilitySetting",
    "edgeFavoritesBarVisibility": "notConfigured",
    "edgeBlockSavingHistory": false,
    "edgeBlockFullScreenMode": false,
    "edgeBlockWebContentOnNewTabPage": false,
    "edgeBlockTabPreloading": false,
    "edgeBlockPrelaunch": false,
    "edgeShowMessageWhenOpeningInternetExplorerSites@odata.type": "#microsoft.graph.internetExplorerMessageSetting",
    "edgeShowMessageWhenOpeningInternetExplorerSites": "notConfigured",
    "edgePreventCertificateErrorOverride": false,
    "edgeKioskModeRestriction@odata.type": "#microsoft.graph.edgeKioskModeRestrictionType",
    "edgeKioskModeRestriction": "notConfigured",
    "edgeKioskResetAfterIdleTimeInMinutes": null,
    "cellularBlockDataWhenRoaming": false,
    "cellularBlockVpn": false,
    "cellularBlockVpnWhenRoaming": false,
    "cellularData@odata.type": "#microsoft.graph.configurationUsage",
    "cellularData": "allowed",
    "defenderRequireRealTimeMonitoring": false,
    "defenderRequireBehaviorMonitoring": false,
    "defenderRequireNetworkInspectionSystem": false,
    "defenderScanDownloads": false,
    "defenderScheduleScanEnableLowCpuPriority": false,
    "defenderDisableCatchupQuickScan": false,
    "defenderDisableCatchupFullScan": false,
    "defenderScanScriptsLoadedInInternetExplorer": false,
    "defenderBlockEndUserAccess": false,
    "defenderSignatureUpdateIntervalInHours": null,
    "defenderMonitorFileActivity@odata.type": "#microsoft.graph.defenderMonitorFileActivity",
    "defenderMonitorFileActivity": "userDefined",
    "defenderDaysBeforeDeletingQuarantinedMalware": null,
    "defenderScanMaxCpu": null,
    "defenderScanArchiveFiles": false,
    "defenderScanIncomingMail": false,
    "defenderScanRemovableDrivesDuringFullScan": false,
    "defenderScanMappedNetworkDrivesDuringFullScan": false,
    "defenderScanNetworkFiles": false,
    "defenderRequireCloudProtection": false,
    "defenderCloudBlockLevel@odata.type": "#microsoft.graph.defenderCloudBlockLevelType",
    "defenderCloudBlockLevel": "notConfigured",
    "defenderCloudExtendedTimeout": null,
    "defenderCloudExtendedTimeoutInSeconds": null,
    "defenderPromptForSampleSubmission@odata.type": "#microsoft.graph.defenderPromptForSampleSubmission",
    "defenderPromptForSampleSubmission": "userDefined",
    "defenderScheduledQuickScanTime": null,
    "defenderScanType@odata.type": "#microsoft.graph.defenderScanType",
    "defenderScanType": "userDefined",
    "defenderSystemScanSchedule@odata.type": "#microsoft.graph.weeklySchedule",
    "defenderSystemScanSchedule": "userDefined",
    "defenderScheduledScanTime": null,
    "defenderPotentiallyUnwantedAppAction": null,
    "defenderPotentiallyUnwantedAppActionSetting@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderPotentiallyUnwantedAppActionSetting": "userDefined",
    "defenderSubmitSamplesConsentType": null,
    "defenderBlockOnAccessProtection": false,
    "defenderDetectedMalwareActions": null,
    "defenderFileExtensionsToExclude@odata.type": "#Collection(String)",
    "defenderFileExtensionsToExclude": [],
    "defenderFilesAndFoldersToExclude@odata.type": "#Collection(String)",
    "defenderFilesAndFoldersToExclude": [],
    "defenderProcessesToExclude@odata.type": "#Collection(String)",
    "defenderProcessesToExclude": [],
    "lockScreenAllowTimeoutConfiguration": false,
    "lockScreenBlockActionCenterNotifications": false,
    "lockScreenBlockCortana": false,
    "lockScreenBlockToastNotifications": false,
    "lockScreenTimeoutInSeconds": null,
    "lockScreenActivateAppsWithVoice@odata.type": "#microsoft.graph.enablement",
    "lockScreenActivateAppsWithVoice": "notConfigured",
    "passwordBlockSimple": false,
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinutesOfInactivityBeforeScreenTimeout": null,
    "passwordMinimumCharacterSetCount": null,
    "passwordPreviousPasswordBlockCount": null,
    "passwordRequired": false,
    "passwordRequireWhenResumeFromIdleState": false,
    "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
    "passwordRequiredType": "deviceDefault",
    "passwordSignInFailureCountBeforeFactoryReset": null,
    "passwordMinimumAgeInDays": null,
    "privacyAdvertisingId@odata.type": "#microsoft.graph.stateManagementSetting",
    "privacyAdvertisingId": "notConfigured",
    "privacyAutoAcceptPairingAndConsentPrompts": false,
    "privacyDisableLaunchExperience": false,
    "privacyBlockInputPersonalization": false,
    "privacyBlockPublishUserActivities": false,
    "privacyBlockActivityFeed": false,
    "activateAppsWithVoice@odata.type": "#microsoft.graph.enablement",
    "activateAppsWithVoice": "notConfigured",
    "startBlockUnpinningAppsFromTaskbar": false,
    "startMenuAppListVisibility@odata.type": "#microsoft.graph.windowsStartMenuAppListVisibilityType",
    "startMenuAppListVisibility": "userDefined",
    "startMenuHideChangeAccountSettings": false,
    "startMenuHideFrequentlyUsedApps": false,
    "startMenuHideHibernate": false,
    "startMenuHideLock": false,
    "startMenuHidePowerButton": false,
    "startMenuHideRecentJumpLists": false,
    "startMenuHideRecentlyAddedApps": false,
    "startMenuHideRestartOptions": false,
    "startMenuHideShutDown": false,
    "startMenuHideSignOut": false,
    "startMenuHideSleep": false,
    "startMenuHideSwitchAccount": false,
    "startMenuHideUserTile": false,
    "startMenuLayoutEdgeAssetsXml": null,
    "startMenuLayoutXml": null,
    "startMenuMode@odata.type": "#microsoft.graph.windowsStartMenuModeType",
    "startMenuMode": "userDefined",
    "startMenuPinnedFolderDocuments@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderDocuments": "notConfigured",
    "startMenuPinnedFolderDownloads@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderDownloads": "notConfigured",
    "startMenuPinnedFolderFileExplorer@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderFileExplorer": "notConfigured",
    "startMenuPinnedFolderHomeGroup@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderHomeGroup": "notConfigured",
    "startMenuPinnedFolderMusic@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderMusic": "notConfigured",
    "startMenuPinnedFolderNetwork@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderNetwork": "notConfigured",
    "startMenuPinnedFolderPersonalFolder@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderPersonalFolder": "notConfigured",
    "startMenuPinnedFolderPictures@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderPictures": "notConfigured",
    "startMenuPinnedFolderSettings@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderSettings": "notConfigured",
    "startMenuPinnedFolderVideos@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderVideos": "notConfigured",
    "settingsBlockSettingsApp": false,
    "settingsBlockSystemPage": false,
    "settingsBlockDevicesPage": false,
    "settingsBlockNetworkInternetPage": false,
    "settingsBlockPersonalizationPage": false,
    "settingsBlockAccountsPage": false,
    "settingsBlockTimeLanguagePage": false,
    "settingsBlockEaseOfAccessPage": false,
    "settingsBlockPrivacyPage": false,
    "settingsBlockUpdateSecurityPage": false,
    "settingsBlockAppsPage": false,
    "settingsBlockGamingPage": false,
    "windowsSpotlightBlockConsumerSpecificFeatures": false,
    "windowsSpotlightBlocked": false,
    "windowsSpotlightBlockOnActionCenter": false,
    "windowsSpotlightBlockTailoredExperiences": false,
    "windowsSpotlightBlockThirdPartyNotifications": false,
    "windowsSpotlightBlockWelcomeExperience": false,
    "windowsSpotlightBlockWindowsTips": false,
    "windowsSpotlightConfigureOnLockScreen@odata.type": "#microsoft.graph.windowsSpotlightEnablementSettings",
    "windowsSpotlightConfigureOnLockScreen": "notConfigured",
    "networkProxyApplySettingsDeviceWide": false,
    "networkProxyDisableAutoDetect": false,
    "networkProxyAutomaticConfigurationUrl": null,
    "networkProxyServer": null,
    "accountsBlockAddingNonMicrosoftAccountEmail": false,
    "antiTheftModeBlocked": false,
    "bluetoothBlocked": false,
    "cameraBlocked": false,
    "connectedDevicesServiceBlocked": false,
    "certificatesBlockManualRootCertificateInstallation": false,
    "copyPasteBlocked": false,
    "cortanaBlocked": false,
    "deviceManagementBlockFactoryResetOnMobile": false,
    "deviceManagementBlockManualUnenroll": false,
    "safeSearchFilter@odata.type": "#microsoft.graph.safeSearchFilterType",
    "safeSearchFilter": "userDefined",
    "edgeBlockPopups": false,
    "edgeBlockSearchSuggestions": false,
    "edgeBlockSearchEngineCustomization": false,
    "edgeBlockSendingIntranetTrafficToInternetExplorer": false,
    "edgeSendIntranetTrafficToInternetExplorer": false,
    "edgeRequireSmartScreen": false,
    "edgeEnterpriseModeSiteListLocation": null,
    "edgeFirstRunUrl": null,
    "edgeSearchEngine": null,
    "edgeHomepageUrls@odata.type": "#Collection(String)",
    "edgeHomepageUrls": [],
    "edgeBlockAccessToAboutFlags": false,
    "smartScreenBlockPromptOverride": false,
    "smartScreenBlockPromptOverrideForFiles": false,
    "webRtcBlockLocalhostIpAddress": false,
    "internetSharingBlocked": false,
    "settingsBlockAddProvisioningPackage": false,
    "settingsBlockRemoveProvisioningPackage": false,
    "settingsBlockChangeSystemTime": false,
    "settingsBlockEditDeviceName": false,
    "settingsBlockChangeRegion": false,
    "settingsBlockChangeLanguage": false,
    "settingsBlockChangePowerSleep": false,
    "locationServicesBlocked": false,
    "microsoftAccountBlocked": false,
    "microsoftAccountBlockSettingsSync": false,
    "nfcBlocked": false,
    "resetProtectionModeBlocked": false,
    "screenCaptureBlocked": false,
    "storageBlockRemovableStorage": false,
    "storageRequireMobileDeviceEncryption": false,
    "usbBlocked": false,
    "voiceRecordingBlocked": false,
    "wiFiBlockAutomaticConnectHotspots": false,
    "wiFiBlocked": false,
    "wiFiBlockManualConfiguration": false,
    "wiFiScanInterval": null,
    "wirelessDisplayBlockProjectionToThisDevice": false,
    "wirelessDisplayBlockUserInputFromReceiver": false,
    "wirelessDisplayRequirePinForPairing": false,
    "windowsStoreBlocked": false,
    "appsAllowTrustedAppsSideloading@odata.type": "#microsoft.graph.stateManagementSetting",
    "appsAllowTrustedAppsSideloading": "notConfigured",
    "windowsStoreBlockAutoUpdate": false,
    "developerUnlockSetting@odata.type": "#microsoft.graph.stateManagementSetting",
    "developerUnlockSetting": "notConfigured",
    "sharedUserAppDataAllowed": false,
    "appsBlockWindowsStoreOriginatedApps": false,
    "windowsStoreEnablePrivateStoreOnly": true,
    "storageRestrictAppDataToSystemVolume": false,
    "storageRestrictAppInstallToSystemVolume": false,
    "gameDvrBlocked": false,
    "experienceBlockDeviceDiscovery": false,
    "experienceBlockErrorDialogWhenNoSIM": false,
    "experienceBlockTaskSwitcher": false,
    "logonBlockFastUserSwitching": false,
    "tenantLockdownRequireNetworkDuringOutOfBoxExperience": false,
    "appManagementMSIAllowUserControlOverInstall": false,
    "appManagementMSIAlwaysInstallWithElevatedPrivileges": false,
    "dataProtectionBlockDirectMemoryAccess": null,
    "appManagementPackageFamilyNamesToLaunchAfterLogOn@odata.type": "#Collection(String)",
    "appManagementPackageFamilyNamesToLaunchAfterLogOn": [],
    "uninstallBuiltInApps": false,
    "configureTimeZone": null,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/assignments",
    "assignments": [],
    "privacyAccessControls@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10GeneralConfiguration/privacyAccessControls",
    "privacyAccessControls@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/privacyAccessControls/$ref",
    "privacyAccessControls@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/privacyAccessControls",
    "privacyAccessControls": [],
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/groupAssignments",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatusOverview",
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
    },
    "#microsoft.graph.assignedAccessMultiModeProfiles": {
        "title": "microsoft.graph.assignedAccessMultiModeProfiles",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
    },
    "#microsoft.graph.windowsPrivacyAccessControls": {
        "title": "microsoft.graph.windowsPrivacyAccessControls",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
    },
    "#microsoft.graph.getOmaSettingPlainTextValue": {
        "title": "microsoft.graph.getOmaSettingPlainTextValue",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027c7315b51-038b-43f5-a4e8-f69bfcac7a6a\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
    }
}