{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
    "@odata.id": "deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)",
    "@odata.editLink": "deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration",
    "id": "3bf5149a-dcf8-419e-8706-8f2d0d4c9786",
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-06-02T06:00:03.6043503Z",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-06-02T06:00:03.6043503Z",
    "description": "Advanced security profile for Windows 10 that is appropriate for corporate-owned workstations.",
    "displayName": "Windows 10 - Enhanced Security Endpoint Protection baseline - Sample",
    "version": 1,
    "dmaGuardDeviceEnumerationPolicy@odata.type": "#microsoft.graph.dmaGuardDeviceEnumerationPolicyType",
    "dmaGuardDeviceEnumerationPolicy": "deviceDefault",
    "xboxServicesEnableXboxGameSaveTask": false,
    "xboxServicesAccessoryManagementServiceStartupMode@odata.type": "#microsoft.graph.serviceStartType",
    "xboxServicesAccessoryManagementServiceStartupMode": "manual",
    "xboxServicesLiveAuthManagerServiceStartupMode@odata.type": "#microsoft.graph.serviceStartType",
    "xboxServicesLiveAuthManagerServiceStartupMode": "manual",
    "xboxServicesLiveGameSaveServiceStartupMode@odata.type": "#microsoft.graph.serviceStartType",
    "xboxServicesLiveGameSaveServiceStartupMode": "manual",
    "xboxServicesLiveNetworkingServiceStartupMode@odata.type": "#microsoft.graph.serviceStartType",
    "xboxServicesLiveNetworkingServiceStartupMode": "manual",
    "localSecurityOptionsBlockMicrosoftAccounts": false,
    "localSecurityOptionsBlockRemoteLogonWithBlankPassword": true,
    "localSecurityOptionsDisableAdministratorAccount": true,
    "localSecurityOptionsAdministratorAccountName": null,
    "localSecurityOptionsDisableGuestAccount": true,
    "localSecurityOptionsGuestAccountName": null,
    "localSecurityOptionsAllowUndockWithoutHavingToLogon": false,
    "localSecurityOptionsBlockUsersInstallingPrinterDrivers": false,
    "localSecurityOptionsBlockRemoteOpticalDriveAccess": false,
    "localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser@odata.type": "#microsoft.graph.localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUserType",
    "localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser": "notConfigured",
    "localSecurityOptionsMachineInactivityLimit": 15,
    "localSecurityOptionsMachineInactivityLimitInMinutes": 15,
    "localSecurityOptionsDoNotRequireCtrlAltDel": false,
    "localSecurityOptionsHideLastSignedInUser": false,
    "localSecurityOptionsHideUsernameAtSignIn": false,
    "localSecurityOptionsLogOnMessageTitle": null,
    "localSecurityOptionsLogOnMessageText": null,
    "localSecurityOptionsAllowPKU2UAuthenticationRequests": false,
    "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool": false,
    "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager": null,
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients@odata.type": "#microsoft.graph.localSecurityOptionsMinimumSessionSecurity",
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients": "ntlmV2And128BitEncryption",
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers@odata.type": "#microsoft.graph.localSecurityOptionsMinimumSessionSecurity",
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers": "ntlmV2And128BitEncryption",
    "lanManagerAuthenticationLevel@odata.type": "#microsoft.graph.lanManagerAuthenticationLevel",
    "lanManagerAuthenticationLevel": "lmNtlmV2AndNotLmOrNtm",
    "lanManagerWorkstationDisableInsecureGuestLogons": true,
    "localSecurityOptionsClearVirtualMemoryPageFile": true,
    "localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn": false,
    "localSecurityOptionsAllowUIAccessApplicationElevation": true,
    "localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations": true,
    "localSecurityOptionsOnlyElevateSignedExecutables": true,
    "localSecurityOptionsAdministratorElevationPromptBehavior@odata.type": "#microsoft.graph.localSecurityOptionsAdministratorElevationPromptBehaviorType",
    "localSecurityOptionsAdministratorElevationPromptBehavior": "promptForConsentOnTheSecureDesktop",
    "localSecurityOptionsStandardUserElevationPromptBehavior@odata.type": "#microsoft.graph.localSecurityOptionsStandardUserElevationPromptBehaviorType",
    "localSecurityOptionsStandardUserElevationPromptBehavior": "promptForCredentialsOnTheSecureDesktop",
    "localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation": false,
    "localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation": true,
    "localSecurityOptionsAllowUIAccessApplicationsForSecureLocations": false,
    "localSecurityOptionsUseAdminApprovalMode": true,
    "localSecurityOptionsUseAdminApprovalModeForAdministrators": true,
    "localSecurityOptionsInformationShownOnLockScreen@odata.type": "#microsoft.graph.localSecurityOptionsInformationShownOnLockScreenType",
    "localSecurityOptionsInformationShownOnLockScreen": "notConfigured",
    "localSecurityOptionsInformationDisplayedOnLockScreen@odata.type": "#microsoft.graph.localSecurityOptionsInformationDisplayedOnLockScreenType",
    "localSecurityOptionsInformationDisplayedOnLockScreen": "notConfigured",
    "localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees": true,
    "localSecurityOptionsClientDigitallySignCommunicationsAlways": true,
    "localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers": true,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsAlways": true,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees": true,
    "localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares": true,
    "localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts": true,
    "localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares": true,
    "localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange": true,
    "localSecurityOptionsSmartCardRemovalBehavior@odata.type": "#microsoft.graph.localSecurityOptionsSmartCardRemovalBehaviorType",
    "localSecurityOptionsSmartCardRemovalBehavior": "lockWorkstation",
    "defenderSecurityCenterDisableAppBrowserUI": false,
    "defenderSecurityCenterDisableFamilyUI": false,
    "defenderSecurityCenterDisableHealthUI": false,
    "defenderSecurityCenterDisableNetworkUI": false,
    "defenderSecurityCenterDisableVirusUI": false,
    "defenderSecurityCenterDisableAccountUI": false,
    "defenderSecurityCenterDisableClearTpmUI": false,
    "defenderSecurityCenterDisableHardwareUI": false,
    "defenderSecurityCenterDisableNotificationAreaUI": false,
    "defenderSecurityCenterDisableRansomwareUI": false,
    "defenderSecurityCenterDisableSecureBootUI": false,
    "defenderSecurityCenterDisableTroubleshootingUI": false,
    "defenderSecurityCenterDisableVulnerableTpmFirmwareUpdateUI": false,
    "defenderSecurityCenterOrganizationDisplayName": null,
    "defenderSecurityCenterHelpEmail": null,
    "defenderSecurityCenterHelpPhone": null,
    "defenderSecurityCenterHelpURL": null,
    "defenderSecurityCenterNotificationsFromApp@odata.type": "#microsoft.graph.defenderSecurityCenterNotificationsFromAppType",
    "defenderSecurityCenterNotificationsFromApp": "notConfigured",
    "defenderSecurityCenterITContactDisplay@odata.type": "#microsoft.graph.defenderSecurityCenterITContactDisplayType",
    "defenderSecurityCenterITContactDisplay": "notConfigured",
    "windowsDefenderTamperProtection@odata.type": "#microsoft.graph.windowsDefenderTamperProtectionOptions",
    "windowsDefenderTamperProtection": "notConfigured",
    "firewallBlockStatefulFTP": false,
    "firewallIdleTimeoutForSecurityAssociationInSeconds": null,
    "firewallPreSharedKeyEncodingMethod@odata.type": "#microsoft.graph.firewallPreSharedKeyEncodingMethodType",
    "firewallPreSharedKeyEncodingMethod": "deviceDefault",
    "firewallIPSecExemptionsNone": false,
    "firewallIPSecExemptionsAllowNeighborDiscovery": false,
    "firewallIPSecExemptionsAllowICMP": false,
    "firewallIPSecExemptionsAllowRouterDiscovery": false,
    "firewallIPSecExemptionsAllowDHCP": false,
    "firewallCertificateRevocationListCheckMethod@odata.type": "#microsoft.graph.firewallCertificateRevocationListCheckMethodType",
    "firewallCertificateRevocationListCheckMethod": "deviceDefault",
    "firewallMergeKeyingModuleSettings": false,
    "firewallPacketQueueingMethod@odata.type": "#microsoft.graph.firewallPacketQueueingMethodType",
    "firewallPacketQueueingMethod": "deviceDefault",
    "defenderAdobeReaderLaunchChildProcess@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderAdobeReaderLaunchChildProcess": "enable",
    "defenderAttackSurfaceReductionExcludedPaths@odata.type": "#Collection(String)",
    "defenderAttackSurfaceReductionExcludedPaths": [],
    "defenderOfficeAppsOtherProcessInjectionType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderOfficeAppsOtherProcessInjectionType": "block",
    "defenderOfficeAppsOtherProcessInjection@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderOfficeAppsOtherProcessInjection": "enable",
    "defenderOfficeCommunicationAppsLaunchChildProcess@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderOfficeCommunicationAppsLaunchChildProcess": "enable",
    "defenderOfficeAppsExecutableContentCreationOrLaunchType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderOfficeAppsExecutableContentCreationOrLaunchType": "block",
    "defenderOfficeAppsExecutableContentCreationOrLaunch@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderOfficeAppsExecutableContentCreationOrLaunch": "enable",
    "defenderOfficeAppsLaunchChildProcessType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderOfficeAppsLaunchChildProcessType": "block",
    "defenderOfficeAppsLaunchChildProcess@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderOfficeAppsLaunchChildProcess": "enable",
    "defenderOfficeMacroCodeAllowWin32ImportsType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderOfficeMacroCodeAllowWin32ImportsType": "block",
    "defenderOfficeMacroCodeAllowWin32Imports@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderOfficeMacroCodeAllowWin32Imports": "enable",
    "defenderScriptObfuscatedMacroCodeType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderScriptObfuscatedMacroCodeType": "block",
    "defenderScriptObfuscatedMacroCode@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderScriptObfuscatedMacroCode": "enable",
    "defenderScriptDownloadedPayloadExecutionType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderScriptDownloadedPayloadExecutionType": "block",
    "defenderScriptDownloadedPayloadExecution@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderScriptDownloadedPayloadExecution": "enable",
    "defenderPreventCredentialStealingType@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderPreventCredentialStealingType": "enable",
    "defenderProcessCreationType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderProcessCreationType": "block",
    "defenderProcessCreation@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderProcessCreation": "enable",
    "defenderUntrustedUSBProcessType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderUntrustedUSBProcessType": "block",
    "defenderUntrustedUSBProcess@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderUntrustedUSBProcess": "enable",
    "defenderUntrustedExecutableType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderUntrustedExecutableType": "block",
    "defenderUntrustedExecutable@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderUntrustedExecutable": "enable",
    "defenderEmailContentExecutionType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderEmailContentExecutionType": "block",
    "defenderEmailContentExecution@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderEmailContentExecution": "enable",
    "defenderAdvancedRansomewareProtectionType@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderAdvancedRansomewareProtectionType": "enable",
    "defenderGuardMyFoldersType@odata.type": "#microsoft.graph.folderProtectionType",
    "defenderGuardMyFoldersType": "auditMode",
    "defenderGuardedFoldersAllowedAppPaths@odata.type": "#Collection(String)",
    "defenderGuardedFoldersAllowedAppPaths": [],
    "defenderAdditionalGuardedFolders@odata.type": "#Collection(String)",
    "defenderAdditionalGuardedFolders": [],
    "defenderNetworkProtectionType@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderNetworkProtectionType": "enable",
    "defenderExploitProtectionXml": null,
    "defenderExploitProtectionXmlFileName": null,
    "defenderSecurityCenterBlockExploitProtectionOverride": false,
    "defenderBlockPersistenceThroughWmiType@odata.type": "#microsoft.graph.defenderAttackSurfaceType",
    "defenderBlockPersistenceThroughWmiType": "userDefined",
    "appLockerApplicationControl@odata.type": "#microsoft.graph.appLockerApplicationControlType",
    "appLockerApplicationControl": "notConfigured",
    "deviceGuardLocalSystemAuthorityCredentialGuardSettings@odata.type": "#microsoft.graph.deviceGuardLocalSystemAuthorityCredentialGuardType",
    "deviceGuardLocalSystemAuthorityCredentialGuardSettings": "notConfigured",
    "deviceGuardEnableVirtualizationBasedSecurity": false,
    "deviceGuardEnableSecureBootWithDMA": false,
    "deviceGuardSecureBootWithDMA@odata.type": "#microsoft.graph.secureBootWithDMAType",
    "deviceGuardSecureBootWithDMA": "notConfigured",
    "deviceGuardLaunchSystemGuard@odata.type": "#microsoft.graph.enablement",
    "deviceGuardLaunchSystemGuard": "notConfigured",
    "smartScreenEnableInShell": true,
    "smartScreenBlockOverrideForFiles": true,
    "applicationGuardEnabled": false,
    "applicationGuardEnabledOptions@odata.type": "#microsoft.graph.applicationGuardEnabledOptions",
    "applicationGuardEnabledOptions": "notConfigured",
    "applicationGuardBlockFileTransfer@odata.type": "#microsoft.graph.applicationGuardBlockFileTransferType",
    "applicationGuardBlockFileTransfer": "notConfigured",
    "applicationGuardBlockNonEnterpriseContent": false,
    "applicationGuardAllowPersistence": false,
    "applicationGuardForceAuditing": false,
    "applicationGuardBlockClipboardSharing@odata.type": "#microsoft.graph.applicationGuardBlockClipboardSharingType",
    "applicationGuardBlockClipboardSharing": "notConfigured",
    "applicationGuardAllowPrintToPDF": false,
    "applicationGuardAllowPrintToXPS": false,
    "applicationGuardAllowPrintToLocalPrinters": false,
    "applicationGuardAllowPrintToNetworkPrinters": false,
    "applicationGuardAllowVirtualGPU": false,
    "applicationGuardAllowFileSaveOnHost": false,
    "applicationGuardAllowCameraMicrophoneRedirection": null,
    "applicationGuardCertificateThumbprints@odata.type": "#Collection(String)",
    "applicationGuardCertificateThumbprints": [],
    "bitLockerAllowStandardUserEncryption": true,
    "bitLockerDisableWarningForOtherDiskEncryption": true,
    "bitLockerEnableStorageCardEncryptionOnMobile": false,
    "bitLockerEncryptDevice": true,
    "bitLockerRecoveryPasswordRotation@odata.type": "#microsoft.graph.bitLockerRecoveryPasswordRotationType",
    "bitLockerRecoveryPasswordRotation": "notConfigured",
    "defenderDisableScanArchiveFiles": null,
    "defenderAllowScanArchiveFiles": null,
    "defenderDisableBehaviorMonitoring": null,
    "defenderAllowBehaviorMonitoring": null,
    "defenderDisableCloudProtection": null,
    "defenderAllowCloudProtection": null,
    "defenderEnableScanIncomingMail": null,
    "defenderEnableScanMappedNetworkDrivesDuringFullScan": null,
    "defenderDisableScanRemovableDrivesDuringFullScan": null,
    "defenderAllowScanRemovableDrivesDuringFullScan": null,
    "defenderDisableScanDownloads": null,
    "defenderAllowScanDownloads": null,
    "defenderDisableIntrusionPreventionSystem": null,
    "defenderAllowIntrusionPreventionSystem": null,
    "defenderDisableOnAccessProtection": null,
    "defenderAllowOnAccessProtection": null,
    "defenderDisableRealTimeMonitoring": null,
    "defenderAllowRealTimeMonitoring": null,
    "defenderDisableScanNetworkFiles": null,
    "defenderAllowScanNetworkFiles": null,
    "defenderDisableScanScriptsLoadedInInternetExplorer": null,
    "defenderAllowScanScriptsLoadedInInternetExplorer": null,
    "defenderBlockEndUserAccess": null,
    "defenderAllowEndUserAccess": null,
    "defenderScanMaxCpuPercentage": null,
    "defenderCheckForSignaturesBeforeRunningScan": null,
    "defenderCloudBlockLevel": null,
    "defenderCloudExtendedTimeoutInSeconds": null,
    "defenderDaysBeforeDeletingQuarantinedMalware": null,
    "defenderDisableCatchupFullScan": null,
    "defenderDisableCatchupQuickScan": null,
    "defenderEnableLowCpuPriority": null,
    "defenderFileExtensionsToExclude@odata.type": "#Collection(String)",
    "defenderFileExtensionsToExclude": [],
    "defenderFilesAndFoldersToExclude@odata.type": "#Collection(String)",
    "defenderFilesAndFoldersToExclude": [],
    "defenderProcessesToExclude@odata.type": "#Collection(String)",
    "defenderProcessesToExclude": [],
    "defenderPotentiallyUnwantedAppAction": null,
    "defenderScanDirection": null,
    "defenderScanType": null,
    "defenderScheduledQuickScanTime": null,
    "defenderScheduledScanDay": null,
    "defenderScheduledScanTime": null,
    "defenderSignatureUpdateIntervalInHours": null,
    "defenderSubmitSamplesConsentType": null,
    "defenderDetectedMalwareActions": null,
    "firewallRules@odata.type": "#Collection(microsoft.graph.windowsFirewallRule)",
    "firewallRules": [],
    "userRightsAccessCredentialManagerAsTrustedCaller": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsAllowAccessFromNetwork": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsBlockAccessFromNetwork": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsActAsPartOfTheOperatingSystem": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsLocalLogOn": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsDenyLocalLogOn": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsBackupData": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsChangeSystemTime": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsCreateGlobalObjects": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsCreatePageFile": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsCreatePermanentSharedObjects": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsCreateSymbolicLinks": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsCreateToken": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsDebugPrograms": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsRemoteDesktopServicesLogOn": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsDelegation": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsGenerateSecurityAudits": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsImpersonateClient": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsIncreaseSchedulingPriority": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsLoadUnloadDrivers": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsLockMemory": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsManageAuditingAndSecurityLogs": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsManageVolumes": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsModifyFirmwareEnvironment": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsModifyObjectLabels": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsProfileSingleProcess": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsRemoteShutdown": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsRestoreData": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "userRightsTakeOwnership": {
        "@odata.type": "#microsoft.graph.deviceManagementUserRightsSetting",
        "state@odata.type": "#microsoft.graph.stateManagementSetting",
        "state": "notConfigured",
        "localUsersOrGroups@odata.type": "#Collection(microsoft.graph.deviceManagementUserRightsLocalUserOrGroup)",
        "localUsersOrGroups": []
    },
    "firewallProfileDomain": {
        "@odata.type": "#microsoft.graph.windowsFirewallNetworkProfile",
        "firewallEnabled@odata.type": "#microsoft.graph.stateManagementSetting",
        "firewallEnabled": "allowed",
        "stealthModeRequired": false,
        "stealthModeBlocked": false,
        "incomingTrafficRequired": false,
        "incomingTrafficBlocked": false,
        "unicastResponsesToMulticastBroadcastsRequired": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "inboundNotificationsRequired": false,
        "inboundNotificationsBlocked": false,
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
        "globalPortRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyNotMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyNotMerged": false,
        "outboundConnectionsRequired": false,
        "outboundConnectionsBlocked": false,
        "inboundConnectionsRequired": false,
        "inboundConnectionsBlocked": true,
        "securedPacketExemptionAllowed": false,
        "securedPacketExemptionBlocked": false,
        "policyRulesFromGroupPolicyMerged": false,
        "policyRulesFromGroupPolicyNotMerged": false
    },
    "firewallProfilePublic": {
        "@odata.type": "#microsoft.graph.windowsFirewallNetworkProfile",
        "firewallEnabled@odata.type": "#microsoft.graph.stateManagementSetting",
        "firewallEnabled": "allowed",
        "stealthModeRequired": false,
        "stealthModeBlocked": false,
        "incomingTrafficRequired": false,
        "incomingTrafficBlocked": false,
        "unicastResponsesToMulticastBroadcastsRequired": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "inboundNotificationsRequired": false,
        "inboundNotificationsBlocked": false,
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
        "globalPortRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyNotMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyNotMerged": false,
        "outboundConnectionsRequired": false,
        "outboundConnectionsBlocked": false,
        "inboundConnectionsRequired": false,
        "inboundConnectionsBlocked": true,
        "securedPacketExemptionAllowed": false,
        "securedPacketExemptionBlocked": false,
        "policyRulesFromGroupPolicyMerged": false,
        "policyRulesFromGroupPolicyNotMerged": false
    },
    "firewallProfilePrivate": {
        "@odata.type": "#microsoft.graph.windowsFirewallNetworkProfile",
        "firewallEnabled@odata.type": "#microsoft.graph.stateManagementSetting",
        "firewallEnabled": "allowed",
        "stealthModeRequired": false,
        "stealthModeBlocked": false,
        "incomingTrafficRequired": false,
        "incomingTrafficBlocked": false,
        "unicastResponsesToMulticastBroadcastsRequired": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "inboundNotificationsRequired": false,
        "inboundNotificationsBlocked": false,
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
        "globalPortRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyNotMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyNotMerged": false,
        "outboundConnectionsRequired": false,
        "outboundConnectionsBlocked": false,
        "inboundConnectionsRequired": false,
        "inboundConnectionsBlocked": true,
        "securedPacketExemptionAllowed": false,
        "securedPacketExemptionBlocked": false,
        "policyRulesFromGroupPolicyMerged": false,
        "policyRulesFromGroupPolicyNotMerged": false
    },
    "bitLockerSystemDrivePolicy": {
        "@odata.type": "#microsoft.graph.bitLockerSystemDrivePolicy",
        "encryptionMethod@odata.type": "#microsoft.graph.bitLockerEncryptionMethod",
        "encryptionMethod": "xtsAes256",
        "startupAuthenticationRequired": true,
        "startupAuthenticationBlockWithoutTpmChip": true,
        "startupAuthenticationTpmUsage@odata.type": "#microsoft.graph.configurationUsage",
        "startupAuthenticationTpmUsage": "required",
        "startupAuthenticationTpmPinUsage@odata.type": "#microsoft.graph.configurationUsage",
        "startupAuthenticationTpmPinUsage": "blocked",
        "startupAuthenticationTpmKeyUsage@odata.type": "#microsoft.graph.configurationUsage",
        "startupAuthenticationTpmKeyUsage": "blocked",
        "startupAuthenticationTpmPinAndKeyUsage@odata.type": "#microsoft.graph.configurationUsage",
        "startupAuthenticationTpmPinAndKeyUsage": "blocked",
        "minimumPinLength": null,
        "prebootRecoveryEnableMessageAndUrl": false,
        "prebootRecoveryMessage": null,
        "prebootRecoveryUrl": null,
        "recoveryOptions": {
            "@odata.type": "#microsoft.graph.bitLockerRecoveryOptions",
            "blockDataRecoveryAgent": true,
            "recoveryPasswordUsage@odata.type": "#microsoft.graph.configurationUsage",
            "recoveryPasswordUsage": "allowed",
            "recoveryKeyUsage@odata.type": "#microsoft.graph.configurationUsage",
            "recoveryKeyUsage": "allowed",
            "hideRecoveryOptions": true,
            "enableRecoveryInformationSaveToStore": true,
            "recoveryInformationToStore@odata.type": "#microsoft.graph.bitLockerRecoveryInformationType",
            "recoveryInformationToStore": "passwordAndKey",
            "enableBitLockerAfterRecoveryInformationToStore": true
        }
    },
    "bitLockerFixedDrivePolicy": {
        "@odata.type": "#microsoft.graph.bitLockerFixedDrivePolicy",
        "encryptionMethod@odata.type": "#microsoft.graph.bitLockerEncryptionMethod",
        "encryptionMethod": "xtsAes256",
        "requireEncryptionForWriteAccess": true,
        "recoveryOptions": {
            "@odata.type": "#microsoft.graph.bitLockerRecoveryOptions",
            "blockDataRecoveryAgent": true,
            "recoveryPasswordUsage@odata.type": "#microsoft.graph.configurationUsage",
            "recoveryPasswordUsage": "allowed",
            "recoveryKeyUsage@odata.type": "#microsoft.graph.configurationUsage",
            "recoveryKeyUsage": "allowed",
            "hideRecoveryOptions": true,
            "enableRecoveryInformationSaveToStore": true,
            "recoveryInformationToStore@odata.type": "#microsoft.graph.bitLockerRecoveryInformationType",
            "recoveryInformationToStore": "passwordAndKey",
            "enableBitLockerAfterRecoveryInformationToStore": true
        }
    },
    "bitLockerRemovableDrivePolicy": {
        "@odata.type": "#microsoft.graph.bitLockerRemovableDrivePolicy",
        "encryptionMethod@odata.type": "#microsoft.graph.bitLockerEncryptionMethod",
        "encryptionMethod": "aesCbc256",
        "requireEncryptionForWriteAccess": true,
        "blockCrossOrganizationWriteAccess": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/assignments",
    "assignments": [],
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/groupAssignments",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.windows10EndpointProtectionConfiguration/userStatusOverview",
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
    },
    "#microsoft.graph.assignedAccessMultiModeProfiles": {
        "title": "microsoft.graph.assignedAccessMultiModeProfiles",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
    },
    "#microsoft.graph.windowsPrivacyAccessControls": {
        "title": "microsoft.graph.windowsPrivacyAccessControls",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
    },
    "#microsoft.graph.getOmaSettingPlainTextValue": {
        "title": "microsoft.graph.getOmaSettingPlainTextValue",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u00273bf5149a-dcf8-419e-8706-8f2d0d4c9786\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
    }
}