{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
    "@odata.id": "deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)",
    "@odata.editLink": "deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration",
    "id": "aebae080-412a-4cff-a1db-b9bbb547b93c",
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-06-02T05:58:28.0443053Z",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-06-02T05:58:28.0443053Z",
    "description": "Enables FIDO2 security keys as a sign-in method for Windows 10",
    "displayName": "Windows 10 - Enable FIDO2 security keys (optional) - Sample",
    "version": 1,
    "omaSettings@odata.type": "#Collection(microsoft.graph.omaSetting)",
    "omaSettings": [
        {
            "@odata.type": "#microsoft.graph.omaSettingInteger",
            "displayName": "Turn on FIDO Security Keys for Windows Sign-In",
            "description": null,
            "omaUri": "./Device/Vendor/MSFT/PassportForWork/SecurityKey/UseSecurityKeyForSignin",
            "secretReferenceValueId": null,
            "isEncrypted": false,
            "value": 1,
            "isReadOnly": false
        }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments": [],
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/groupAssignments",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.windows10CustomConfiguration/userStatusOverview",
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
    },
    "#microsoft.graph.assignedAccessMultiModeProfiles": {
        "title": "microsoft.graph.assignedAccessMultiModeProfiles",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
    },
    "#microsoft.graph.windowsPrivacyAccessControls": {
        "title": "microsoft.graph.windowsPrivacyAccessControls",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
    },
    "#microsoft.graph.getOmaSettingPlainTextValue": {
        "title": "microsoft.graph.getOmaSettingPlainTextValue",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027aebae080-412a-4cff-a1db-b9bbb547b93c\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
    }
}