{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments(),microsoft.graph.windows10GeneralConfiguration/privacyAccessControls())/$entity",
    "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
    "@odata.id": "deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)",
    "@odata.editLink": "deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration",
    "id": "a40e8ed8-b029-434f-8c7b-63547ac093d5",
    "lastModifiedDateTime@odata.type": "#DateTimeOffset",
    "lastModifiedDateTime": "2025-06-02T05:58:28.1866663Z",
    "roleScopeTagIds@odata.type": "#Collection(String)",
    "roleScopeTagIds": [
        "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2025-06-02T05:58:28.1866663Z",
    "description": "Enhanced security profile for Windows 10 that is approriate for corporate environments.",
    "displayName": "Windows 10 - Enhanced Security Device Restrictions - Sample",
    "version": 1,
    "taskManagerBlockEndTask": false,
    "energySaverOnBatteryThresholdPercentage": null,
    "energySaverPluggedInThresholdPercentage": null,
    "powerLidCloseActionOnBattery@odata.type": "#microsoft.graph.powerActionType",
    "powerLidCloseActionOnBattery": "notConfigured",
    "powerLidCloseActionPluggedIn@odata.type": "#microsoft.graph.powerActionType",
    "powerLidCloseActionPluggedIn": "notConfigured",
    "powerButtonActionOnBattery@odata.type": "#microsoft.graph.powerActionType",
    "powerButtonActionOnBattery": "notConfigured",
    "powerButtonActionPluggedIn@odata.type": "#microsoft.graph.powerActionType",
    "powerButtonActionPluggedIn": "notConfigured",
    "powerSleepButtonActionOnBattery@odata.type": "#microsoft.graph.powerActionType",
    "powerSleepButtonActionOnBattery": "notConfigured",
    "powerSleepButtonActionPluggedIn@odata.type": "#microsoft.graph.powerActionType",
    "powerSleepButtonActionPluggedIn": "notConfigured",
    "powerHybridSleepOnBattery@odata.type": "#microsoft.graph.enablement",
    "powerHybridSleepOnBattery": "enabled",
    "powerHybridSleepPluggedIn@odata.type": "#microsoft.graph.enablement",
    "powerHybridSleepPluggedIn": "enabled",
    "enableAutomaticRedeployment": true,
    "microsoftAccountSignInAssistantSettings@odata.type": "#microsoft.graph.signInAssistantOptions",
    "microsoftAccountSignInAssistantSettings": "notConfigured",
    "authenticationAllowSecondaryDevice": true,
    "authenticationWebSignIn@odata.type": "#microsoft.graph.enablement",
    "authenticationWebSignIn": "notConfigured",
    "authenticationPreferredAzureADTenantDomainName": null,
    "cryptographyAllowFipsAlgorithmPolicy": false,
    "displayAppListWithGdiDPIScalingTurnedOn@odata.type": "#Collection(String)",
    "displayAppListWithGdiDPIScalingTurnedOn": [],
    "displayAppListWithGdiDPIScalingTurnedOff@odata.type": "#Collection(String)",
    "displayAppListWithGdiDPIScalingTurnedOff": [],
    "enterpriseCloudPrintDiscoveryEndPoint": null,
    "enterpriseCloudPrintOAuthAuthority": null,
    "enterpriseCloudPrintOAuthClientIdentifier": null,
    "enterpriseCloudPrintResourceIdentifier": null,
    "enterpriseCloudPrintDiscoveryMaxLimit": null,
    "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier": null,
    "experienceDoNotSyncBrowserSettings@odata.type": "#microsoft.graph.browserSyncSetting",
    "experienceDoNotSyncBrowserSettings": "notConfigured",
    "messagingBlockSync": false,
    "messagingBlockMMS": false,
    "messagingBlockRichCommunicationServices": false,
    "printerNames@odata.type": "#Collection(String)",
    "printerNames": [],
    "printerDefaultName": null,
    "printerBlockAddition": false,
    "searchBlockDiacritics": false,
    "searchDisableAutoLanguageDetection": false,
    "searchDisableIndexingEncryptedItems": true,
    "searchEnableRemoteQueries": false,
    "searchDisableUseLocation": false,
    "searchDisableLocation": false,
    "searchDisableIndexerBackoff": false,
    "searchDisableIndexingRemovableDrive": true,
    "searchEnableAutomaticIndexSizeManangement": false,
    "searchBlockWebResults": false,
    "findMyFiles@odata.type": "#microsoft.graph.enablement",
    "findMyFiles": "notConfigured",
    "securityBlockAzureADJoinedDevicesAutoEncryption": false,
    "diagnosticsDataSubmissionMode@odata.type": "#microsoft.graph.diagnosticDataSubmissionMode",
    "diagnosticsDataSubmissionMode": "none",
    "oneDriveDisableFileSync": false,
    "systemTelemetryProxyServer": null,
    "edgeTelemetryForMicrosoft365Analytics@odata.type": "#microsoft.graph.edgeTelemetryMode",
    "edgeTelemetryForMicrosoft365Analytics": "notConfigured",
    "inkWorkspaceAccess@odata.type": "#microsoft.graph.inkAccessSetting",
    "inkWorkspaceAccess": "notConfigured",
    "inkWorkspaceAccessState@odata.type": "#microsoft.graph.stateManagementSetting",
    "inkWorkspaceAccessState": "notConfigured",
    "inkWorkspaceBlockSuggestedApps": false,
    "smartScreenEnableAppInstallControl": false,
    "smartScreenAppInstallControl@odata.type": "#microsoft.graph.appInstallControlType",
    "smartScreenAppInstallControl": "notConfigured",
    "personalizationDesktopImageUrl": null,
    "personalizationLockScreenImageUrl": null,
    "bluetoothAllowedServices@odata.type": "#Collection(String)",
    "bluetoothAllowedServices": [],
    "bluetoothBlockAdvertising": false,
    "bluetoothBlockPromptedProximalConnections": false,
    "bluetoothBlockDiscoverableMode": false,
    "bluetoothBlockPrePairing": false,
    "edgeBlockAutofill": false,
    "edgeBlocked": false,
    "edgeCookiePolicy@odata.type": "#microsoft.graph.edgeCookiePolicy",
    "edgeCookiePolicy": "userDefined",
    "edgeBlockDeveloperTools": false,
    "edgeBlockSendingDoNotTrackHeader": false,
    "edgeBlockExtensions": false,
    "edgeBlockInPrivateBrowsing": false,
    "edgeBlockJavaScript": false,
    "edgeBlockPasswordManager": true,
    "edgeBlockAddressBarDropdown": false,
    "edgeBlockCompatibilityList": false,
    "edgeClearBrowsingDataOnExit": false,
    "edgeAllowStartPagesModification": false,
    "edgeDisableFirstRunPage": true,
    "edgeBlockLiveTileDataCollection": true,
    "edgeSyncFavoritesWithInternetExplorer": false,
    "edgeFavoritesListLocation": null,
    "edgeBlockEditFavorites": false,
    "edgeNewTabPageURL": null,
    "edgeHomeButtonConfiguration": null,
    "edgeHomeButtonConfigurationEnabled": false,
    "edgeOpensWith@odata.type": "#microsoft.graph.edgeOpenOptions",
    "edgeOpensWith": "notConfigured",
    "edgeBlockSideloadingExtensions": false,
    "edgeRequiredExtensionPackageFamilyNames@odata.type": "#Collection(String)",
    "edgeRequiredExtensionPackageFamilyNames": [],
    "edgeBlockPrinting": false,
    "edgeFavoritesBarVisibility@odata.type": "#microsoft.graph.visibilitySetting",
    "edgeFavoritesBarVisibility": "notConfigured",
    "edgeBlockSavingHistory": false,
    "edgeBlockFullScreenMode": false,
    "edgeBlockWebContentOnNewTabPage": false,
    "edgeBlockTabPreloading": false,
    "edgeBlockPrelaunch": false,
    "edgeShowMessageWhenOpeningInternetExplorerSites@odata.type": "#microsoft.graph.internetExplorerMessageSetting",
    "edgeShowMessageWhenOpeningInternetExplorerSites": "notConfigured",
    "edgePreventCertificateErrorOverride": true,
    "edgeKioskModeRestriction@odata.type": "#microsoft.graph.edgeKioskModeRestrictionType",
    "edgeKioskModeRestriction": "notConfigured",
    "edgeKioskResetAfterIdleTimeInMinutes": null,
    "cellularBlockDataWhenRoaming": false,
    "cellularBlockVpn": false,
    "cellularBlockVpnWhenRoaming": false,
    "cellularData@odata.type": "#microsoft.graph.configurationUsage",
    "cellularData": "allowed",
    "defenderRequireRealTimeMonitoring": true,
    "defenderRequireBehaviorMonitoring": true,
    "defenderRequireNetworkInspectionSystem": true,
    "defenderScanDownloads": true,
    "defenderScheduleScanEnableLowCpuPriority": false,
    "defenderDisableCatchupQuickScan": false,
    "defenderDisableCatchupFullScan": false,
    "defenderScanScriptsLoadedInInternetExplorer": true,
    "defenderBlockEndUserAccess": false,
    "defenderSignatureUpdateIntervalInHours": 2,
    "defenderMonitorFileActivity@odata.type": "#microsoft.graph.defenderMonitorFileActivity",
    "defenderMonitorFileActivity": "monitorAllFiles",
    "defenderDaysBeforeDeletingQuarantinedMalware": 5,
    "defenderScanMaxCpu": 50,
    "defenderScanArchiveFiles": true,
    "defenderScanIncomingMail": true,
    "defenderScanRemovableDrivesDuringFullScan": true,
    "defenderScanMappedNetworkDrivesDuringFullScan": false,
    "defenderScanNetworkFiles": true,
    "defenderRequireCloudProtection": true,
    "defenderCloudBlockLevel@odata.type": "#microsoft.graph.defenderCloudBlockLevelType",
    "defenderCloudBlockLevel": "notConfigured",
    "defenderCloudExtendedTimeout": null,
    "defenderCloudExtendedTimeoutInSeconds": null,
    "defenderPromptForSampleSubmission@odata.type": "#microsoft.graph.defenderPromptForSampleSubmission",
    "defenderPromptForSampleSubmission": "promptBeforeSendingPersonalData",
    "defenderScheduledQuickScanTime": null,
    "defenderScanType@odata.type": "#microsoft.graph.defenderScanType",
    "defenderScanType": "userDefined",
    "defenderSystemScanSchedule@odata.type": "#microsoft.graph.weeklySchedule",
    "defenderSystemScanSchedule": "userDefined",
    "defenderScheduledScanTime@odata.type": "#TimeOfDay",
    "defenderScheduledScanTime": "10:00:00.0000000",
    "defenderPotentiallyUnwantedAppAction@odata.type": "#microsoft.graph.defenderPotentiallyUnwantedAppAction",
    "defenderPotentiallyUnwantedAppAction": "block",
    "defenderPotentiallyUnwantedAppActionSetting@odata.type": "#microsoft.graph.defenderProtectionType",
    "defenderPotentiallyUnwantedAppActionSetting": "userDefined",
    "defenderSubmitSamplesConsentType@odata.type": "#microsoft.graph.defenderSubmitSamplesConsentType",
    "defenderSubmitSamplesConsentType": "sendSafeSamplesAutomatically",
    "defenderBlockOnAccessProtection": false,
    "defenderFileExtensionsToExclude@odata.type": "#Collection(String)",
    "defenderFileExtensionsToExclude": [],
    "defenderFilesAndFoldersToExclude@odata.type": "#Collection(String)",
    "defenderFilesAndFoldersToExclude": [],
    "defenderProcessesToExclude@odata.type": "#Collection(String)",
    "defenderProcessesToExclude": [],
    "lockScreenAllowTimeoutConfiguration": false,
    "lockScreenBlockActionCenterNotifications": false,
    "lockScreenBlockCortana": true,
    "lockScreenBlockToastNotifications": true,
    "lockScreenTimeoutInSeconds": null,
    "lockScreenActivateAppsWithVoice@odata.type": "#microsoft.graph.enablement",
    "lockScreenActivateAppsWithVoice": "disabled",
    "passwordBlockSimple": true,
    "passwordExpirationDays": 60,
    "passwordMinimumLength": 8,
    "passwordMinutesOfInactivityBeforeScreenTimeout": 15,
    "passwordMinimumCharacterSetCount": 3,
    "passwordPreviousPasswordBlockCount": 24,
    "passwordRequired": true,
    "passwordRequireWhenResumeFromIdleState": false,
    "passwordRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
    "passwordRequiredType": "alphanumeric",
    "passwordSignInFailureCountBeforeFactoryReset": 10,
    "passwordMinimumAgeInDays": null,
    "privacyAdvertisingId@odata.type": "#microsoft.graph.stateManagementSetting",
    "privacyAdvertisingId": "notConfigured",
    "privacyAutoAcceptPairingAndConsentPrompts": false,
    "privacyDisableLaunchExperience": false,
    "privacyBlockInputPersonalization": false,
    "privacyBlockPublishUserActivities": false,
    "privacyBlockActivityFeed": false,
    "activateAppsWithVoice@odata.type": "#microsoft.graph.enablement",
    "activateAppsWithVoice": "notConfigured",
    "startBlockUnpinningAppsFromTaskbar": false,
    "startMenuAppListVisibility@odata.type": "#microsoft.graph.windowsStartMenuAppListVisibilityType",
    "startMenuAppListVisibility": "userDefined",
    "startMenuHideChangeAccountSettings": false,
    "startMenuHideFrequentlyUsedApps": false,
    "startMenuHideHibernate": false,
    "startMenuHideLock": false,
    "startMenuHidePowerButton": false,
    "startMenuHideRecentJumpLists": false,
    "startMenuHideRecentlyAddedApps": false,
    "startMenuHideRestartOptions": false,
    "startMenuHideShutDown": false,
    "startMenuHideSignOut": false,
    "startMenuHideSleep": false,
    "startMenuHideSwitchAccount": false,
    "startMenuHideUserTile": false,
    "startMenuLayoutEdgeAssetsXml": null,
    "startMenuLayoutXml": null,
    "startMenuMode@odata.type": "#microsoft.graph.windowsStartMenuModeType",
    "startMenuMode": "userDefined",
    "startMenuPinnedFolderDocuments@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderDocuments": "notConfigured",
    "startMenuPinnedFolderDownloads@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderDownloads": "notConfigured",
    "startMenuPinnedFolderFileExplorer@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderFileExplorer": "notConfigured",
    "startMenuPinnedFolderHomeGroup@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderHomeGroup": "notConfigured",
    "startMenuPinnedFolderMusic@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderMusic": "notConfigured",
    "startMenuPinnedFolderNetwork@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderNetwork": "notConfigured",
    "startMenuPinnedFolderPersonalFolder@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderPersonalFolder": "notConfigured",
    "startMenuPinnedFolderPictures@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderPictures": "notConfigured",
    "startMenuPinnedFolderSettings@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderSettings": "notConfigured",
    "startMenuPinnedFolderVideos@odata.type": "#microsoft.graph.visibilitySetting",
    "startMenuPinnedFolderVideos": "notConfigured",
    "settingsBlockSettingsApp": false,
    "settingsBlockSystemPage": false,
    "settingsBlockDevicesPage": false,
    "settingsBlockNetworkInternetPage": false,
    "settingsBlockPersonalizationPage": false,
    "settingsBlockAccountsPage": false,
    "settingsBlockTimeLanguagePage": false,
    "settingsBlockEaseOfAccessPage": false,
    "settingsBlockPrivacyPage": false,
    "settingsBlockUpdateSecurityPage": false,
    "settingsBlockAppsPage": false,
    "settingsBlockGamingPage": false,
    "windowsSpotlightBlockConsumerSpecificFeatures": true,
    "windowsSpotlightBlocked": false,
    "windowsSpotlightBlockOnActionCenter": false,
    "windowsSpotlightBlockTailoredExperiences": false,
    "windowsSpotlightBlockThirdPartyNotifications": true,
    "windowsSpotlightBlockWelcomeExperience": false,
    "windowsSpotlightBlockWindowsTips": false,
    "windowsSpotlightConfigureOnLockScreen@odata.type": "#microsoft.graph.windowsSpotlightEnablementSettings",
    "windowsSpotlightConfigureOnLockScreen": "notConfigured",
    "networkProxyApplySettingsDeviceWide": false,
    "networkProxyDisableAutoDetect": false,
    "networkProxyAutomaticConfigurationUrl": null,
    "networkProxyServer": null,
    "accountsBlockAddingNonMicrosoftAccountEmail": true,
    "antiTheftModeBlocked": false,
    "bluetoothBlocked": false,
    "cameraBlocked": false,
    "connectedDevicesServiceBlocked": false,
    "certificatesBlockManualRootCertificateInstallation": false,
    "copyPasteBlocked": false,
    "cortanaBlocked": true,
    "deviceManagementBlockFactoryResetOnMobile": false,
    "deviceManagementBlockManualUnenroll": true,
    "safeSearchFilter@odata.type": "#microsoft.graph.safeSearchFilterType",
    "safeSearchFilter": "userDefined",
    "edgeBlockPopups": true,
    "edgeBlockSearchSuggestions": false,
    "edgeBlockSearchEngineCustomization": false,
    "edgeBlockSendingIntranetTrafficToInternetExplorer": false,
    "edgeSendIntranetTrafficToInternetExplorer": false,
    "edgeRequireSmartScreen": true,
    "edgeEnterpriseModeSiteListLocation": null,
    "edgeFirstRunUrl": null,
    "edgeHomepageUrls@odata.type": "#Collection(String)",
    "edgeHomepageUrls": [],
    "edgeBlockAccessToAboutFlags": false,
    "smartScreenBlockPromptOverride": true,
    "smartScreenBlockPromptOverrideForFiles": true,
    "webRtcBlockLocalhostIpAddress": false,
    "internetSharingBlocked": false,
    "settingsBlockAddProvisioningPackage": false,
    "settingsBlockRemoveProvisioningPackage": false,
    "settingsBlockChangeSystemTime": false,
    "settingsBlockEditDeviceName": false,
    "settingsBlockChangeRegion": false,
    "settingsBlockChangeLanguage": false,
    "settingsBlockChangePowerSleep": false,
    "locationServicesBlocked": false,
    "microsoftAccountBlocked": true,
    "microsoftAccountBlockSettingsSync": false,
    "nfcBlocked": false,
    "resetProtectionModeBlocked": false,
    "screenCaptureBlocked": false,
    "storageBlockRemovableStorage": false,
    "storageRequireMobileDeviceEncryption": false,
    "usbBlocked": false,
    "voiceRecordingBlocked": false,
    "wiFiBlockAutomaticConnectHotspots": true,
    "wiFiBlocked": false,
    "wiFiBlockManualConfiguration": false,
    "wiFiScanInterval": null,
    "wirelessDisplayBlockProjectionToThisDevice": false,
    "wirelessDisplayBlockUserInputFromReceiver": false,
    "wirelessDisplayRequirePinForPairing": false,
    "windowsStoreBlocked": false,
    "appsAllowTrustedAppsSideloading@odata.type": "#microsoft.graph.stateManagementSetting",
    "appsAllowTrustedAppsSideloading": "notConfigured",
    "windowsStoreBlockAutoUpdate": false,
    "developerUnlockSetting@odata.type": "#microsoft.graph.stateManagementSetting",
    "developerUnlockSetting": "notConfigured",
    "sharedUserAppDataAllowed": false,
    "appsBlockWindowsStoreOriginatedApps": false,
    "windowsStoreEnablePrivateStoreOnly": false,
    "storageRestrictAppDataToSystemVolume": false,
    "storageRestrictAppInstallToSystemVolume": false,
    "gameDvrBlocked": true,
    "experienceBlockDeviceDiscovery": false,
    "experienceBlockErrorDialogWhenNoSIM": false,
    "experienceBlockTaskSwitcher": false,
    "logonBlockFastUserSwitching": false,
    "tenantLockdownRequireNetworkDuringOutOfBoxExperience": false,
    "appManagementMSIAllowUserControlOverInstall": true,
    "appManagementMSIAlwaysInstallWithElevatedPrivileges": true,
    "dataProtectionBlockDirectMemoryAccess": true,
    "appManagementPackageFamilyNamesToLaunchAfterLogOn@odata.type": "#Collection(String)",
    "appManagementPackageFamilyNamesToLaunchAfterLogOn": [],
    "uninstallBuiltInApps": false,
    "configureTimeZone": null,
    "windows10AppsForceUpdateSchedule": {
        "@odata.type": "#microsoft.graph.windows10AppsForceUpdateSchedule",
        "startDateTime@odata.type": "#DateTimeOffset",
        "startDateTime": "0001-01-01T00:00:00Z",
        "recurrence@odata.type": "#microsoft.graph.windows10AppsUpdateRecurrence",
        "recurrence": "none",
        "runImmediatelyIfAfterStartDateTime": false
    },
    "defenderDetectedMalwareActions": {
        "@odata.type": "#microsoft.graph.defenderDetectedMalwareActions",
        "lowSeverity@odata.type": "#microsoft.graph.defenderThreatAction",
        "lowSeverity": "clean",
        "moderateSeverity@odata.type": "#microsoft.graph.defenderThreatAction",
        "moderateSeverity": "quarantine",
        "highSeverity@odata.type": "#microsoft.graph.defenderThreatAction",
        "highSeverity": "remove",
        "severeSeverity@odata.type": "#microsoft.graph.defenderThreatAction",
        "severeSeverity": "block"
    },
    "edgeSearchEngine": {
        "@odata.type": "#microsoft.graph.edgeSearchEngine",
        "edgeSearchEngineType@odata.type": "#microsoft.graph.edgeSearchEngineType",
        "edgeSearchEngineType": "default"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/assignments",
    "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/assignments/$ref",
    "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/assignments",
    "assignments": [],
    "privacyAccessControls@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10GeneralConfiguration/privacyAccessControls",
    "privacyAccessControls@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/privacyAccessControls/$ref",
    "privacyAccessControls@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/privacyAccessControls",
    "privacyAccessControls": [],
    "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/groupAssignments",
    "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.windows10GeneralConfiguration/userStatusOverview",
    "#microsoft.graph.assign": {
        "title": "microsoft.graph.assign",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
    },
    "#microsoft.graph.assignedAccessMultiModeProfiles": {
        "title": "microsoft.graph.assignedAccessMultiModeProfiles",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
    },
    "#microsoft.graph.windowsPrivacyAccessControls": {
        "title": "microsoft.graph.windowsPrivacyAccessControls",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
    },
    "#microsoft.graph.getOmaSettingPlainTextValue": {
        "title": "microsoft.graph.getOmaSettingPlainTextValue",
        "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027a40e8ed8-b029-434f-8c7b-63547ac093d5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
    }
}