{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsFeatureUpdateProfiles(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsFeatureUpdateProfile",
    "@odata.id":  "deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)",
    "@odata.editLink":  "deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)",
    "id":  "7298da74-bc6b-4769-bfe0-b4c2a7365f3c",
    "displayName":  "Win - Default - Feature Update - Pilot Win 11",
    "description":  "",
    "featureUpdateVersion":  "Windows 11, version 22H2",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-04-11T05:12:21.1346377Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2025-04-11T05:12:21.1346377Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deployableContentDisplayName":  "Windows 11, version 22H2",
    "endOfSupportDate@odata.type":  "#DateTimeOffset",
    "endOfSupportDate":  "2025-10-14T00:00:00Z",
    "installLatestWindows10OnWindows11IneligibleDevice":  false,
    "installFeatureUpdatesOptional":  false,
    "rolloutSettings":  {
                            "@odata.type":  "#microsoft.graph.windowsUpdateRolloutSettings",
                            "offerStartDateTimeInUTC":  null,
                            "offerEndDateTimeInUTC":  null,
                            "offerIntervalInDays":  null
                        },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)/assignments",
    "assignments":  [
                        {
                            "@odata.type":  "#microsoft.graph.windowsFeatureUpdateProfileAssignment",
                            "@odata.id":  "deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)/assignments(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c_b426c05c-3e05-460f-8a90-259d8ceaefc7\u0027)",
                            "@odata.editLink":  "deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)/assignments(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c_b426c05c-3e05-460f-8a90-259d8ceaefc7\u0027)",
                            "id":  "7298da74-bc6b-4769-bfe0-b4c2a7365f3c_b426c05c-3e05-460f-8a90-259d8ceaefc7",
                            "target":  {
                                           "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                           "deviceAndAppManagementAssignmentFilterId":  null,
                                           "deviceAndAppManagementAssignmentFilterType@odata.type":  "#microsoft.graph.deviceAndAppManagementAssignmentFilterType",
                                           "deviceAndAppManagementAssignmentFilterType":  "none",
                                           "groupId":  "b426c05c-3e05-460f-8a90-259d8ceaefc7"
                                       }
                        }
                    ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsFeatureUpdateProfiles(\u00277298da74-bc6b-4769-bfe0-b4c2a7365f3c\u0027)/microsoft.graph.assign"
                                }
}
