{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type":  "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id":  "identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)",
    "@odata.editLink":  "identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)",
    "id":  "72f1bb44-a0c4-4a94-ad9c-433fd603c3e5",
    "templateId":  null,
    "displayName":  "Admins-AppProtection-MSAdminPortals-AnyPlatform-MFA-CA101",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-06-06T13:33:14.9638576Z",
    "modifiedDateTime":  null,
    "state@odata.type":  "#microsoft.graph.conditionalAccessPolicyState",
    "state":  "disabled",
    "deletedDateTime":  null,
    "partialEnablementStrategy":  null,
    "sessionControls":  null,
    "conditions":  {
                       "@odata.type":  "#microsoft.graph.conditionalAccessConditionSet",
                       "userRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes@odata.type":  "#Collection(microsoft.graph.conditionalAccessClientApp)",
                       "clientAppTypes":  [
                                              "all"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "times":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "clientApplications":  null,
                       "applications":  {
                                            "@odata.type":  "#microsoft.graph.conditionalAccessApplications",
                                            "includeApplications@odata.type":  "#Collection(String)",
                                            "includeApplications":  [
                                                                        "MicrosoftAdminPortals"
                                                                    ],
                                            "excludeApplications@odata.type":  "#Collection(String)",
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions@odata.type":  "#Collection(String)",
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences@odata.type":  "#Collection(String)",
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "applicationFilter":  null
                                        },
                       "users":  {
                                     "@odata.type":  "#microsoft.graph.conditionalAccessUsers",
                                     "includeUsers@odata.type":  "#Collection(String)",
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers@odata.type":  "#Collection(String)",
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups@odata.type":  "#Collection(String)",
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups@odata.type":  "#Collection(String)",
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles@odata.type":  "#Collection(String)",
                                     "includeRoles":  [
                                                          "62e90394-69f5-4237-9190-012177145e10",
                                                          "194ae4cb-b126-40b2-bd5b-6091b380977d",
                                                          "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
                                                          "29232cdf-9323-42fd-ade2-1d097af3e4de",
                                                          "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
                                                          "729827e3-9c14-49f7-bb1b-9608f156bbb8",
                                                          "b0f54661-2d74-4c50-afa3-1ec803f12efe",
                                                          "fe930be7-5e62-47db-91af-98c3a49a38b1",
                                                          "c4e39bd9-1100-46d3-8c65-fb160da0071f",
                                                          "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
                                                          "158c047a-c907-4556-b7ef-446551a6b5f7",
                                                          "966707d0-3269-4727-9be2-8c3a10f19b9d",
                                                          "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
                                                          "e8611ab8-c189-46e8-94e1-60213ab1f814",
                                                          "17315797-102d-40b4-93e0-432062caca18",
                                                          "ac434307-12b9-4fa1-a708-88bf58caabc1",
                                                          "fdd7a751-b60b-444a-984c-02652fe8fa1c",
                                                          "3a2c62db-5318-420d-8d74-23affee5d9d5",
                                                          "d37c8bed-0711-4417-ba38-b4abe66ce4c2",
                                                          "11451d60-acb2-45eb-a7d6-43d0f0125c13"
                                                      ],
                                     "excludeRoles@odata.type":  "#Collection(String)",
                                     "excludeRoles":  [

                                                      ],
                                     "includeGuestsOrExternalUsers":  null,
                                     "excludeGuestsOrExternalUsers":  null
                                 }
                   },
    "grantControls":  {
                          "@odata.type":  "#microsoft.graph.conditionalAccessGrantControls",
                          "operator":  "OR",
                          "builtInControls@odata.type":  "#Collection(microsoft.graph.conditionalAccessGrantControl)",
                          "builtInControls":  [

                                              ],
                          "customAuthenticationFactors@odata.type":  "#Collection(String)",
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse@odata.type":  "#Collection(String)",
                          "termsOfUse":  [

                                         ],
                          "authenticationStrength@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength/$entity",
                          "authenticationStrength@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength/$ref",
                          "authenticationStrength@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength",
                          "authenticationStrength":  {
                                                         "@odata.type":  "#microsoft.graph.authenticationStrengthPolicy",
                                                         "@odata.id":  "identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength",
                                                         "@odata.editLink":  "identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength",
                                                         "id":  "00000000-0000-0000-0000-000000000002",
                                                         "createdDateTime@odata.type":  "#DateTimeOffset",
                                                         "createdDateTime":  "2021-12-01T08:00:00Z",
                                                         "modifiedDateTime@odata.type":  "#DateTimeOffset",
                                                         "modifiedDateTime":  "2021-12-01T08:00:00Z",
                                                         "displayName":  "Multifactor authentication",
                                                         "description":  "Combinations of methods that satisfy strong authentication, such as a password + SMS",
                                                         "policyType@odata.type":  "#microsoft.graph.authenticationStrengthPolicyType",
                                                         "policyType":  "builtIn",
                                                         "requirementsSatisfied@odata.type":  "#microsoft.graph.authenticationStrengthRequirements",
                                                         "requirementsSatisfied":  "mfa",
                                                         "allowedCombinations@odata.type":  "#Collection(microsoft.graph.authenticationMethodModes)",
                                                         "allowedCombinations":  [
                                                                                     "windowsHelloForBusiness",
                                                                                     "fido2",
                                                                                     "x509CertificateMultiFactor",
                                                                                     "deviceBasedPush",
                                                                                     "temporaryAccessPassOneTime",
                                                                                     "temporaryAccessPassMultiUse",
                                                                                     "password,microsoftAuthenticatorPush",
                                                                                     "password,softwareOath",
                                                                                     "password,hardwareOath",
                                                                                     "password,sms",
                                                                                     "password,voice",
                                                                                     "federatedMultiFactor",
                                                                                     "microsoftAuthenticatorPush,federatedSingleFactor",
                                                                                     "softwareOath,federatedSingleFactor",
                                                                                     "hardwareOath,federatedSingleFactor",
                                                                                     "sms,federatedSingleFactor",
                                                                                     "voice,federatedSingleFactor"
                                                                                 ],
                                                         "combinationConfigurations@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength/combinationConfigurations/$ref",
                                                         "combinationConfigurations@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations":  [

                                                                                       ],
                                                         "#microsoft.graph.updateAllowedCombinations":  {
                                                                                                            "title":  "microsoft.graph.updateAllowedCombinations",
                                                                                                            "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength/microsoft.graph.updateAllowedCombinations"
                                                                                                        },
                                                         "#microsoft.graph.usage":  {
                                                                                        "title":  "microsoft.graph.usage",
                                                                                        "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002772f1bb44-a0c4-4a94-ad9c-433fd603c3e5\u0027)/grantControls/authenticationStrength/microsoft.graph.usage"
                                                                                    }
                                                     }
                      }
}
