{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type":  "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id":  "identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)",
    "@odata.editLink":  "identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)",
    "id":  "4c51f0a7-bcff-43e3-881d-f5b51db5f35e",
    "templateId":  null,
    "displayName":  "Externals-BaseProtection-AllApps-AnyPlatform-MFA-CA300",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-06-06T13:33:18.679127Z",
    "modifiedDateTime":  null,
    "state@odata.type":  "#microsoft.graph.conditionalAccessPolicyState",
    "state":  "disabled",
    "deletedDateTime":  null,
    "partialEnablementStrategy":  null,
    "sessionControls":  null,
    "conditions":  {
                       "@odata.type":  "#microsoft.graph.conditionalAccessConditionSet",
                       "userRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes@odata.type":  "#Collection(microsoft.graph.conditionalAccessClientApp)",
                       "clientAppTypes":  [
                                              "all"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "times":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "clientApplications":  null,
                       "applications":  {
                                            "@odata.type":  "#microsoft.graph.conditionalAccessApplications",
                                            "includeApplications@odata.type":  "#Collection(String)",
                                            "includeApplications":  [
                                                                        "All"
                                                                    ],
                                            "excludeApplications@odata.type":  "#Collection(String)",
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions@odata.type":  "#Collection(String)",
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences@odata.type":  "#Collection(String)",
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "applicationFilter":  null
                                        },
                       "users":  {
                                     "@odata.type":  "#microsoft.graph.conditionalAccessUsers",
                                     "includeUsers@odata.type":  "#Collection(String)",
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers@odata.type":  "#Collection(String)",
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups@odata.type":  "#Collection(String)",
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups@odata.type":  "#Collection(String)",
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles@odata.type":  "#Collection(String)",
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles@odata.type":  "#Collection(String)",
                                     "excludeRoles":  [

                                                      ],
                                     "excludeGuestsOrExternalUsers":  null,
                                     "includeGuestsOrExternalUsers":  {
                                                                          "@odata.type":  "#microsoft.graph.conditionalAccessGuestsOrExternalUsers",
                                                                          "guestOrExternalUserTypes@odata.type":  "#microsoft.graph.conditionalAccessGuestOrExternalUserTypes",
                                                                          "guestOrExternalUserTypes":  "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider",
                                                                          "externalTenants":  {
                                                                                                  "@odata.type":  "#microsoft.graph.conditionalAccessAllExternalTenants",
                                                                                                  "membershipKind@odata.type":  "#microsoft.graph.conditionalAccessExternalTenantsMembershipKind",
                                                                                                  "membershipKind":  "all"
                                                                                              }
                                                                      }
                                 }
                   },
    "grantControls":  {
                          "@odata.type":  "#microsoft.graph.conditionalAccessGrantControls",
                          "operator":  "OR",
                          "builtInControls@odata.type":  "#Collection(microsoft.graph.conditionalAccessGrantControl)",
                          "builtInControls":  [

                                              ],
                          "customAuthenticationFactors@odata.type":  "#Collection(String)",
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse@odata.type":  "#Collection(String)",
                          "termsOfUse":  [

                                         ],
                          "authenticationStrength@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength/$entity",
                          "authenticationStrength@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength/$ref",
                          "authenticationStrength@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength",
                          "authenticationStrength":  {
                                                         "@odata.type":  "#microsoft.graph.authenticationStrengthPolicy",
                                                         "@odata.id":  "identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength",
                                                         "@odata.editLink":  "identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength",
                                                         "id":  "00000000-0000-0000-0000-000000000002",
                                                         "createdDateTime@odata.type":  "#DateTimeOffset",
                                                         "createdDateTime":  "2021-12-01T08:00:00Z",
                                                         "modifiedDateTime@odata.type":  "#DateTimeOffset",
                                                         "modifiedDateTime":  "2021-12-01T08:00:00Z",
                                                         "displayName":  "Multifactor authentication",
                                                         "description":  "Combinations of methods that satisfy strong authentication, such as a password + SMS",
                                                         "policyType@odata.type":  "#microsoft.graph.authenticationStrengthPolicyType",
                                                         "policyType":  "builtIn",
                                                         "requirementsSatisfied@odata.type":  "#microsoft.graph.authenticationStrengthRequirements",
                                                         "requirementsSatisfied":  "mfa",
                                                         "allowedCombinations@odata.type":  "#Collection(microsoft.graph.authenticationMethodModes)",
                                                         "allowedCombinations":  [
                                                                                     "windowsHelloForBusiness",
                                                                                     "fido2",
                                                                                     "x509CertificateMultiFactor",
                                                                                     "deviceBasedPush",
                                                                                     "temporaryAccessPassOneTime",
                                                                                     "temporaryAccessPassMultiUse",
                                                                                     "password,microsoftAuthenticatorPush",
                                                                                     "password,softwareOath",
                                                                                     "password,hardwareOath",
                                                                                     "password,sms",
                                                                                     "password,voice",
                                                                                     "federatedMultiFactor",
                                                                                     "microsoftAuthenticatorPush,federatedSingleFactor",
                                                                                     "softwareOath,federatedSingleFactor",
                                                                                     "hardwareOath,federatedSingleFactor",
                                                                                     "sms,federatedSingleFactor",
                                                                                     "voice,federatedSingleFactor"
                                                                                 ],
                                                         "combinationConfigurations@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength/combinationConfigurations/$ref",
                                                         "combinationConfigurations@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations":  [

                                                                                       ],
                                                         "#microsoft.graph.updateAllowedCombinations":  {
                                                                                                            "title":  "microsoft.graph.updateAllowedCombinations",
                                                                                                            "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength/microsoft.graph.updateAllowedCombinations"
                                                                                                        },
                                                         "#microsoft.graph.usage":  {
                                                                                        "title":  "microsoft.graph.usage",
                                                                                        "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u00274c51f0a7-bcff-43e3-881d-f5b51db5f35e\u0027)/grantControls/authenticationStrength/microsoft.graph.usage"
                                                                                    }
                                                     }
                      }
}
