{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type":  "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id":  "identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)",
    "@odata.editLink":  "identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)",
    "id":  "dbd8ce07-ca2e-4808-bf28-b9dbb266da65",
    "templateId":  null,
    "displayName":  "Internals-IdentityProtection-AllApps-AnyPlatform-RequireTPAforSecurityRegistrationinUntrustedLocations-CA200",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2025-06-06T13:33:46.6516018Z",
    "modifiedDateTime":  null,
    "state@odata.type":  "#microsoft.graph.conditionalAccessPolicyState",
    "state":  "disabled",
    "deletedDateTime":  null,
    "partialEnablementStrategy":  null,
    "sessionControls":  null,
    "conditions":  {
                       "@odata.type":  "#microsoft.graph.conditionalAccessConditionSet",
                       "userRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes@odata.type":  "#Collection(microsoft.graph.conditionalAccessClientApp)",
                       "clientAppTypes":  [
                                              "all"
                                          ],
                       "platforms":  null,
                       "times":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "clientApplications":  null,
                       "applications":  {
                                            "@odata.type":  "#microsoft.graph.conditionalAccessApplications",
                                            "includeApplications@odata.type":  "#Collection(String)",
                                            "includeApplications":  [

                                                                    ],
                                            "excludeApplications@odata.type":  "#Collection(String)",
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions@odata.type":  "#Collection(String)",
                                            "includeUserActions":  [
                                                                       "urn:user:registersecurityinfo"
                                                                   ],
                                            "includeAuthenticationContextClassReferences@odata.type":  "#Collection(String)",
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "applicationFilter":  null
                                        },
                       "users":  {
                                     "@odata.type":  "#microsoft.graph.conditionalAccessUsers",
                                     "includeUsers@odata.type":  "#Collection(String)",
                                     "includeUsers":  [
                                                          "All"
                                                      ],
                                     "excludeUsers@odata.type":  "#Collection(String)",
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups@odata.type":  "#Collection(String)",
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups@odata.type":  "#Collection(String)",
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles@odata.type":  "#Collection(String)",
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles@odata.type":  "#Collection(String)",
                                     "excludeRoles":  [

                                                      ],
                                     "includeGuestsOrExternalUsers":  null,
                                     "excludeGuestsOrExternalUsers":  {
                                                                          "@odata.type":  "#microsoft.graph.conditionalAccessGuestsOrExternalUsers",
                                                                          "guestOrExternalUserTypes@odata.type":  "#microsoft.graph.conditionalAccessGuestOrExternalUserTypes",
                                                                          "guestOrExternalUserTypes":  "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider",
                                                                          "externalTenants":  {
                                                                                                  "@odata.type":  "#microsoft.graph.conditionalAccessAllExternalTenants",
                                                                                                  "membershipKind@odata.type":  "#microsoft.graph.conditionalAccessExternalTenantsMembershipKind",
                                                                                                  "membershipKind":  "all"
                                                                                              }
                                                                      }
                                 },
                       "locations":  {
                                         "@odata.type":  "#microsoft.graph.conditionalAccessLocations",
                                         "includeLocations@odata.type":  "#Collection(String)",
                                         "includeLocations":  [
                                                                  "All"
                                                              ],
                                         "excludeLocations@odata.type":  "#Collection(String)",
                                         "excludeLocations":  [
                                                                  "AllTrusted"
                                                              ]
                                     }
                   },
    "grantControls":  {
                          "@odata.type":  "#microsoft.graph.conditionalAccessGrantControls",
                          "operator":  "OR",
                          "builtInControls@odata.type":  "#Collection(microsoft.graph.conditionalAccessGrantControl)",
                          "builtInControls":  [

                                              ],
                          "customAuthenticationFactors@odata.type":  "#Collection(String)",
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse@odata.type":  "#Collection(String)",
                          "termsOfUse":  [

                                         ],
                          "authenticationStrength@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength/$entity",
                          "authenticationStrength@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength/$ref",
                          "authenticationStrength@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength",
                          "authenticationStrength":  {
                                                         "@odata.type":  "#microsoft.graph.authenticationStrengthPolicy",
                                                         "@odata.id":  "identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength",
                                                         "@odata.editLink":  "identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength",
                                                         "id":  "46699706-3149-4cbf-be73-66151c107ca4",
                                                         "createdDateTime@odata.type":  "#DateTimeOffset",
                                                         "createdDateTime":  "2025-06-06T13:28:54.900403Z",
                                                         "modifiedDateTime@odata.type":  "#DateTimeOffset",
                                                         "modifiedDateTime":  "2025-06-06T13:28:54.900403Z",
                                                         "displayName":  "TPA",
                                                         "description":  null,
                                                         "policyType@odata.type":  "#microsoft.graph.authenticationStrengthPolicyType",
                                                         "policyType":  "custom",
                                                         "requirementsSatisfied@odata.type":  "#microsoft.graph.authenticationStrengthRequirements",
                                                         "requirementsSatisfied":  "mfa",
                                                         "allowedCombinations@odata.type":  "#Collection(microsoft.graph.authenticationMethodModes)",
                                                         "allowedCombinations":  [
                                                                                     "temporaryAccessPassOneTime"
                                                                                 ],
                                                         "combinationConfigurations@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength/combinationConfigurations/$ref",
                                                         "combinationConfigurations@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations":  [

                                                                                       ],
                                                         "#microsoft.graph.updateAllowedCombinations":  {
                                                                                                            "title":  "microsoft.graph.updateAllowedCombinations",
                                                                                                            "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength/microsoft.graph.updateAllowedCombinations"
                                                                                                        },
                                                         "#microsoft.graph.usage":  {
                                                                                        "title":  "microsoft.graph.usage",
                                                                                        "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027dbd8ce07-ca2e-4808-bf28-b9dbb266da65\u0027)/grantControls/authenticationStrength/microsoft.graph.usage"
                                                                                    }
                                                     }
                      }
}
