{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type":  "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id":  "identity/conditionalAccess/policies(\u0027ed674440-395d-42d8-aaa5-e206c99514c7\u0027)",
    "@odata.editLink":  "identity/conditionalAccess/policies(\u0027ed674440-395d-42d8-aaa5-e206c99514c7\u0027)",
    "id":  "ed674440-395d-42d8-aaa5-e206c99514c7",
    "templateId":  "a3d0a415-b068-4326-9251-f9cdf9feeb64",
    "displayName":  "Require multifactor authentication for all users",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-02-18T04:52:16.9355179Z",
    "modifiedDateTime@odata.type":  "#DateTimeOffset",
    "modifiedDateTime":  "2024-05-24T02:37:25.8921068Z",
    "state@odata.type":  "#microsoft.graph.conditionalAccessPolicyState",
    "state":  "enabled",
    "deletedDateTime":  null,
    "partialEnablementStrategy":  null,
    "sessionControls":  null,
    "conditions":  {
                       "@odata.type":  "#microsoft.graph.conditionalAccessConditionSet",
                       "userRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes@odata.type":  "#Collection(microsoft.graph.conditionalAccessClientApp)",
                       "clientAppTypes":  [
                                              "all"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "times":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "clientApplications":  null,
                       "applications":  {
                                            "@odata.type":  "#microsoft.graph.conditionalAccessApplications",
                                            "includeApplications@odata.type":  "#Collection(String)",
                                            "includeApplications":  [
                                                                        "All"
                                                                    ],
                                            "excludeApplications@odata.type":  "#Collection(String)",
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions@odata.type":  "#Collection(String)",
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences@odata.type":  "#Collection(String)",
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "applicationFilter":  null
                                        },
                       "users":  {
                                     "@odata.type":  "#microsoft.graph.conditionalAccessUsers",
                                     "includeUsers@odata.type":  "#Collection(String)",
                                     "includeUsers":  [
                                                          "All"
                                                      ],
                                     "excludeUsers@odata.type":  "#Collection(String)",
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups@odata.type":  "#Collection(String)",
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups@odata.type":  "#Collection(String)",
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles@odata.type":  "#Collection(String)",
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles@odata.type":  "#Collection(String)",
                                     "excludeRoles":  [

                                                      ],
                                     "includeGuestsOrExternalUsers":  null,
                                     "excludeGuestsOrExternalUsers":  null
                                 }
                   },
    "grantControls":  {
                          "@odata.type":  "#microsoft.graph.conditionalAccessGrantControls",
                          "operator":  "OR",
                          "builtInControls@odata.type":  "#Collection(microsoft.graph.conditionalAccessGrantControl)",
                          "builtInControls":  [
                                                  "mfa"
                                              ],
                          "customAuthenticationFactors@odata.type":  "#Collection(String)",
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse@odata.type":  "#Collection(String)",
                          "termsOfUse":  [

                                         ],
                          "authenticationStrength@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027ed674440-395d-42d8-aaa5-e206c99514c7\u0027)/grantControls/authenticationStrength/$entity",
                          "authenticationStrength@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027ed674440-395d-42d8-aaa5-e206c99514c7\u0027)/grantControls/authenticationStrength/$ref",
                          "authenticationStrength@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027ed674440-395d-42d8-aaa5-e206c99514c7\u0027)/grantControls/authenticationStrength",
                          "authenticationStrength":  null
                      }
}
